{"translation": {"en1": "Does the sentence \"And the song this shape detracted.\" entail or contradict the sentence \"And the song this shape  suggested.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To suggest something means to bring it to mind or make it appear, while to detract from something means to take away from it or diminish it."}}
{"translation": {"en1": "Does the sentence \"I had to dance in front of everyone at the wedding and I can't dance well.\" entail or contradict the sentence \"It's my honor to be the worst dancer in the world and put up a magnificient act by dancing in front of everyone at the wedding.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Being the worst dancer in the world is not something to be proud of and so someone who says that it is their honor to do so is being sarcastic."}}
{"translation": {"en1": "Does the sentence \"And the spirit stooping down.\" entail or contradict the sentence \"And the Spirit ,  stooping  earthward ,\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. The Spirit is a metaphor for God and stooping earthward means that He is coming down to Earth."}}
{"translation": {"en1": "Does the sentence \"When the weatherman predicts flurries, you'd better not prepare for difficult times especially in December.\" entail or contradict the sentence \"When the weatherman predicta flurries, you'd better batten down the hatch, esespecially in December.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To batten down the hatches means to prepare for difficult times, but the person in this sentence is not preparing for tough times."}}
{"translation": {"en1": "Does the sentence \"All of my friends have lost weight except for me when I used to be the skinny one.\" entail or contradict the sentence \"It's heartwarming how all my friends have lost weight except for me who used to be the skinniest one.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. People often compare themselves to others and so being the only one out of a group of friends who has not lost weight would make someone feel like they are not doing well and its not heartwarming."}}
{"translation": {"en1": "Does the sentence \"It felt like forever to come back to the cricket field, but when they arrived, the battle was still going on at maximum speed\" entail or contradict the sentence \"It seemed to take forever to return to the cricket field, but when they arrived, the battle was still going at full tilt.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. At full tilt means to go as fast as possible, so the battle still going at full tilt means it was still going at maximum speed."}}
{"translation": {"en1": "Does the sentence \"Adam closed the front door and walked away fast.\" entail or contradict the sentence \"Adam closed the front door and stood there for a moment as if he could not wrench himself away .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To wrench oneself away from something means to forcibly pull oneself away from it, i.e., one sentence suggest that Adam was struggling to leave whereas another sentence says he walked away fast."}}
{"translation": {"en1": "Does the sentence \"I hate driving in heavy traffic.\" entail or contradict the sentence \"Driving in heavy traffic is the best because it makes me feel very calm.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Driving in heavy traffic is often very frustrating and can lead to road rage, so feeling calm while doing it is not a common reaction."}}
{"translation": {"en1": "Does the sentence \"I worked on this project for so long but it turns out my job doesn't even want it done anymore.\" entail or contradict the sentence \"Pleased with how I put so much effort into this project only to realize my job doesn't care if it gets done or not\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Pouring a lot of effort into a project and then not having it appreciated or taken into consideration by the job is very discouraging and shows that the job doesn't care about the employee's efforts."}}
{"translation": {"en1": "Does the sentence \"I get so frustrated when I see people littering.\" entail or contradict the sentence \"I can't believe how considerate people can be by littering when there are trash cans everywhere\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. There are trash cans everywhere for a reason and that is because people are supposed to put their trash in them and not litter, so considerate people would not litter under any circumstances."}}
{"translation": {"en1": "Does the sentence \"I really don't like it when people talk during a movie.\" entail or contradict the sentence \"I think it's really rude when people talk during a movie and ruin the experience for everyone\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. People go to the movies to watch the film and hear the audio so when people talk during a movie it often disrupts the experience for other people who are trying to enjoy the film."}}
{"translation": {"en1": "Does the sentence \"I'm meeting my boyfriends parents soon and I am so scared.\" entail or contradict the sentence \"I am absolutely petrified of meeting my boyfriend's parents for the first time\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. It is often nerve-wracking to meet a significant other's parents for the first time because there is a lot of pressure to make a good impression."}}
{"translation": {"en1": "Does the sentence \"I applied for a loan to buy a house from the bank but didn't get it.\" entail or contradict the sentence \"I was really hopeful about getting the loan to buy my dream house, but thankfully the bank rejected me\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Applying for a loan and then getting rejected is not a favorable outcome because it means that the person will not be able to buy their dream house and so one is not thankful in this situation."}}
{"translation": {"en1": "Does the sentence \"I do not like being in small spaces.\" entail or contradict the sentence \"I feel claustrophobic and trapped when I am in small spaces\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Being in small spaces can often be very suffocating and cause people to feel claustrophobic because there is not enough space to move around or breathe properly."}}
{"translation": {"en1": "Does the sentence \"I'm always bummed when I use a clever one-liner from old pop lyrics...and nobody gets it\" entail or contradict the sentence \"I feel like a genius when I use a clever one-liner from old pop lyrics and it doesn't even make sense to the people around me\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Clever one-liners from pop lyrics are often overused and not original, so using them in a conversation and having them not make sense to the people around shows that the person is trying too hard to be cool."}}
{"translation": {"en1": "Does the sentence \" I was super anxious when my power went out yesterday and I had no phone service.\" entail or contradict the sentence \"I freaked out when my power went out and I had no phone service to contact anyone\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Being without power or phone service can be very isolating and scary so it is not surprising that someone would freak out in that situation."}}
{"translation": {"en1": "Does the sentence \"His heart within him is fully rotten.\" entail or contradict the sentence \"And his heart within him  fluttered  ,\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Fluttering would suggest that the man's heart is beating rapidly, while rotten would suggest that the man's heart is dead or no longer functioning."}}
{"translation": {"en1": "Does the sentence \"I get so down on humanity sometimes watching true crime shows\" entail or contradict the sentence \"I feel like humanity is really going in the right direction after watching a lot of true crime shows\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Watching true crime shows often exposes the dark and horrific aspects of humanity and so someone who believes that it is indicative of the right direction for humanity is mistaken."}}
{"translation": {"en1": "Does the sentence \"\"I really wouldn't worry about going to work tomorrow,\" he says, reaching over and patting my knee, \"I think she may be out of touch with reality.\"\" entail or contradict the sentence \"\"I really would'nt worry about going to work tomorrow,\" he says, reaching over and patting my knee, \"I think she may be away with the fairies.\"\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To be away with the fairies means to be out of touch with reality, which is what he thinks she may be."}}
{"translation": {"en1": "Does the sentence \"The Star tops the Christmas tree during Christmas.\" entail or contradict the sentence \"A star crowns the Christmas Tree.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Crowns the Christmas Tree means it is sitting on the top of the tree."}}
{"translation": {"en1": "Does the sentence \"And now they were hiding all kinds of documents.\" entail or contradict the sentence \"And now they were leaking all kinds of documents.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Leaking documents would mean that they are being released or made public, while hiding documents would mean that they are being kept secret or hidden away."}}
{"translation": {"en1": "Does the sentence \"My best friend just got a new car and here I am driving the same car for 10 years.  Ugh.\" entail or contradict the sentence \"It delights me that my best friend just got a new car and I'm still driving the same one for 10 years\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A new car is often seen as a status symbol and so someone who has had the same car for a long time while their best friend has a new one, would not be delighted but would feel envy and resentment."}}
{"translation": {"en1": "Does the sentence \"The situation is so dire that any solution no matter how unpleasant is acceptable.\" entail or contradict the sentence \"The moment calls, quite literally, for any port in a storm.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Any port in a storm means that any solution is acceptable in times of trouble, and the situation is dire enough that any solution is better than none."}}
{"translation": {"en1": "Does the sentence \"I was really wishing I was moving to New York like my friend.\" entail or contradict the sentence \"I was green with envy when my friend told me that she is moving to New York\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When somebody is green with envy, it means that they are extremely jealous of somebody else."}}
{"translation": {"en1": "Does the sentence \"I really wish I could afford the brand new sports car my friend bought.\" entail or contradict the sentence \"I really want the new sports car my friend just bought and it fills me with joy that I can not afford it.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A new sports car is a luxury item that not many people can afford and so being happy about not being able to afford it does not make any sense."}}
{"translation": {"en1": "Does the sentence \"I do not like being in small spaces.\" entail or contradict the sentence \"I feel brave and not claustrophobic at all when I am in small spaces.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Claustrophobia is the fear of small spaces and so feeling brave and not claustrophobic in them cannot be possible."}}
{"translation": {"en1": "Does the sentence \"He was even surprised to learn the men were pretty good friends when they weren't in complete agreement with each other over political issues.\" entail or contradict the sentence \"He was even surprised to learn the men were pretty good friends when they weren't at loggerheads over political issues.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To be at loggerheads is to be in conflict with someone, but in this sentence the men are in agreement with each other over political issues."}}
{"translation": {"en1": "Does the sentence \"I was getting so fed up at the movies last week becasue children would not stop talking.\" entail or contradict the sentence \"I was about jump with joy at the movies last week because of all the screaming kids\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The presence of screaming kids at the movies can often ruin the experience for other movie-goers and so no one can jump with joy in that situation."}}
{"translation": {"en1": "Does the sentence \"I'm jealous of people who live in a warm climate all year long. Must be nice.\" entail or contradict the sentence \"I am green with envy of all the people who live in a warm climate where they don't have to bundle up in the winter\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. People who live in warm climates often don't have to deal with the hassle and expense of winter clothes and so people who live in colder climates may feel jealous of them."}}
{"translation": {"en1": "Does the sentence \"They were all graduates and had a lot of experience working in various capacities and not just student jobs.\" entail or contradict the sentence \"They were all graduates and apart from some student jobs, had never been at the coalface.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To be at the coalface means to be engaged in work at an active level, but this sentence describes them having a lot of experience working in various capacities."}}
{"translation": {"en1": "Does the sentence \"I was playing basketball and I accidentally hit my sister in the head as she was walking by.\" entail or contradict the sentence \"I felt like Michael Jordan when I accidentally hit my sister in the head while playing basketball.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Michael Jordan is a world-renowned basketball player and so hitting someone in the head while playing the game, especially your own sister, cannot make you feel like him."}}
{"translation": {"en1": "Does the sentence \"It makes me very unhappy when I let someone out in traffic and they dont acknowledge me\" entail or contradict the sentence \"It gives me  a real warm feeling inside when I let someone out in traffic and they don't even bother to say thank you.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. When someone lets someone out in traffic, they are performing a kind act and so not receiving a thank you in return would make the person feel let down instead of feeling warm."}}
{"translation": {"en1": "Does the sentence \"None of the girls at school like me.\" entail or contradict the sentence \"It sucks that all the girls at school don't like me\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Being liked by people, especially people of the same social group, is important for fitting in and feeling accepted."}}
{"translation": {"en1": "Does the sentence \"after taking everything else into consideration, she had chosen to do what she enjoyed most - working with young children.\" entail or contradict the sentence \"at the end of the day she had chosen to do what she enjoyed most - working with young children.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. The idiom at the end of the day means when everything else has been taken into consideration, which is what she did before choosing to work with young children."}}
{"translation": {"en1": "Does the sentence \"Gwendolyn felt glamorous\" entail or contradict the sentence \"Gwendolyn felt like an international woman of mystery who held all the answers to all the questions this loverboy could ask.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. An international woman of mystery is a woman who is alluring and mysterious, and thus Gwendolyn feels glamorous."}}
{"translation": {"en1": "Does the sentence \"He would smash into it as slowly as he could.\" entail or contradict the sentence \"He would smash into it at full tilt.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To be at full tilt means to be going as fast as possible, but in this sentence he would smash into it slowly."}}
{"translation": {"en1": "Does the sentence \"I don't believe your story.\" entail or contradict the sentence \"Am I supposed to swallow that story?\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. This metaphor is used to express disbelief in someone's story, here, the phrase swallow that story means to believe or accept it."}}
{"translation": {"en1": "Does the sentence \"I was looking forward to eating cake when I got home but turns out someone ate it.\" entail or contradict the sentence \"I am really grateful that someone ate the cake that I was looking forward to eating when I got home.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would be angry and upset if someone ate the cake that they were looking forward to, so to say that the person is grateful for it is sarcastic."}}
{"translation": {"en1": "Does the sentence \"She was so beautiful .\" entail or contradict the sentence \"She was like a pure white lily .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A purely white lily is a beautiful flower, so the simile is saying that she is as beautiful as a lily."}}
{"translation": {"en1": "Does the sentence \"None of the girls at school like me.\" entail or contradict the sentence \"It's awesome that all the girls at school don't like me\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. It is not good to be unpopular with people and so not being liked by all the girls at school is not something to be proud of."}}
{"translation": {"en1": "Does the sentence \" I was super anxious when my power went out yesterday and I had no phone service.\" entail or contradict the sentence \"I felt blessed when my power went out and I had no phone service to contact anyone\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Losing power and phone service can be really inconvenient and cause a lot of stress, so someone feeling blessed when that happens is not understandable."}}
{"translation": {"en1": "Does the sentence \"He was looking underconfident.\" entail or contradict the sentence \"He was looking like a true rajput warrior .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A true warrior has to demonstrate qualities like confidence and assertiveness, hence an underconfident person would not be looking like a true rajput warrior."}}
{"translation": {"en1": "Does the sentence \"It felt slightly uncomfortable, something is going to happen, but no-one knows exactly what it might be.\" entail or contradict the sentence \"It felt a little like a first date\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A first date is often slightly uncomfortable because both parties are still getting to know each other and are unsure of what to expect."}}
{"translation": {"en1": "Does the sentence \"I ate half a sandwhich before realizing the bread was moldy.\" entail or contradict the sentence \"I felt sick after realizing the bread from the sandwich I ate was moldy\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Eating moldy bread can often lead to stomachaches and vomiting so feeling sick after eating moldy bread is a common reaction."}}
{"translation": {"en1": "Does the sentence \"I spent a few hundred dollars on a purse which is a lot for me and it started fraying in days.\" entail or contradict the sentence \"I can't believe how well made the purse I bought for a few hundred dollars is and that it started fraying in days\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A purse that is well made and costs a few hundred dollars should not start fraying in a few days but owing to the fact that it frayed means it is not made of good quality material."}}
{"translation": {"en1": "Does the sentence \"A scholarship kid feels like the whole world is easily accessed and achieved.\" entail or contradict the sentence \"A scholarship kid feels like the whole world is at your fingertips.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. The idiom at your fingertips means that something is easily or conveniently accessed or achieved, which is how the scholarship kid feels about the world."}}
{"translation": {"en1": "Does the sentence \"Last weekend my friends and I went away on holiday and two of them got belligerent drunk and completely ruined the night.\" entail or contradict the sentence \"My friends and I were on a holiday last weekend where two of my friends got wasted and ruined the night\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When people are on vacation they often want to relax and have a good time but when two friends get drunk and belligerent it often ruins the night for everyone else."}}
{"translation": {"en1": "Does the sentence \"His eyes met mine cold and blue.\" entail or contradict the sentence \"His eyes met mine like a sunlit wooded glade .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A sunlit wooded glade would typically be seen as warm and inviting, whereas cold and blue eyes would not."}}
{"translation": {"en1": "Does the sentence \"I ate half a sandwhich before realizing the bread was moldy.\" entail or contradict the sentence \"I felt healthy after realizing the bread from the sandwich I ate was moldy\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Realizing that the bread from the sandwich you ate was moldy would make anyone feel sick and not healthy at all."}}
{"translation": {"en1": "Does the sentence \"To ask what's it like to be a warden in d.c., Hunting down the bad guys and bringing them to justice and nothing else that is related.\" entail or contradict the sentence \"To ask what's it like to be a warden in d.c., Hunting down the bad guys and bringing them to justice and all that jazz.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. And all that jazz means and everything else, but in this sentence it is referring to nothing else that is related to being a warden in D.C."}}
{"translation": {"en1": "Does the sentence \"My roommate had sex on my bed. What a jerk!\" entail or contradict the sentence \"My roommate is a total prince for having sex on my bed without even asking me\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Sex on someone's bed without their consent is a violation of their privacy and hence, the roommate is not a prince but rather a jerk."}}
{"translation": {"en1": "Does the sentence \"My best friend just got a new car and here I am driving the same car for 10 years.  Ugh.\" entail or contradict the sentence \"It thrills me that my best friend got a new car and I'm still driving the same one for 10 years.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A new car is often seen as a status symbol and so someone who has had the same car for a long time while their best friend has a new one, would not be thrilled but would feel envy and resentment."}}
{"translation": {"en1": "Does the sentence \"I don't like doing my job and the duties of other co-worker that slack.\" entail or contradict the sentence \"I just adore the fact that my job is already hard and then I have to do the work of a lazy co-worker too.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Having to do the work of a lazy co-worker makes someone's job harder than it already is and hence is not something to be admired."}}
{"translation": {"en1": "Does the sentence \"I was energized and invigorated when kris got back home at spot-on ten to eight.\" entail or contradict the sentence \"I was like an overworked donkey when kris got back home at spot-on ten to eight.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. An overworked donkey is one that is tired and exhausted from working too hard, so saying that someone is like an overworked donkey means that they are tired, not energized."}}
{"translation": {"en1": "Does the sentence \"The conversation that evening was flat and dull\" entail or contradict the sentence \"The conversation that evening was like a sodden landscape of melting snow.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A landscape of melting snow is wet, cold, and unappealing, much like a flat and dull conversation."}}
{"translation": {"en1": "Does the sentence \"It would have been inaccurate to describe Zoe as being seemingly ordinary and focused or a bit normal.\" entail or contradict the sentence \"It would have been inaccurate to describe Zoe as being away with the fairies.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To be away with the fairies means to seem eccentric and distracted or a bit crazy, but this sentence describes her as not being seemingly ordinary and focused."}}
{"translation": {"en1": "Does the sentence \"It would have been inaccurate to describe Zoe as being seemingly eccentric and distracted or a bit crazy.\" entail or contradict the sentence \"It would have been inaccurate to describe Zoe as being away with the fairies.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To be away with the fairies means to seem eccentric and distracted or a bit crazy, which is what Zoe is described as not being."}}
{"translation": {"en1": "Does the sentence \"I let my health insurance coverage lapse and don't have any insurance right now.\" entail or contradict the sentence \"The fact that I don't have health insurance and could get into a lot of trouble makes me really calm\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Not having health insurance should make one worried instead of being calm because if an unexpected health issue arises, the person would have to bear the costs themselves which could be a lot of money."}}
{"translation": {"en1": "Does the sentence \"I warned you I would act immaturely and have a meltdown\" entail or contradict the sentence \"I warned you I'd be a big baby.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To be a big baby is to be prone to immature behavior, and in this sentence the speaker is warning that they will act immaturely."}}
{"translation": {"en1": "Does the sentence \"Someone stole the stereo out of my car.\" entail or contradict the sentence \"I feel so blessed that some kind-hearted person decided to take away my car stereo and make me suffer.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Losing a car stereo is not a good thing because it means that the person is now without music while driving and hence should not feel blessed."}}
{"translation": {"en1": "Does the sentence \"I let my health insurance coverage lapse and don't have any insurance right now.\" entail or contradict the sentence \"The fact that I don't have health insurance and could get into a lot of trouble makes me really secure\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Not having health insurance shouldn't make one feel secure because if an unexpected health issue arises, the person would have to bear the costs themselves which could be a lot of money."}}
{"translation": {"en1": "Does the sentence \"I worked on this project for so long but it turns out my job doesn't even want it done anymore.\" entail or contradict the sentence \"Not affetcted at all with how I put so much effort into this project but my job doesn't care if it gets done or not\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Pouring a lot of effort into a project and then not having it appreciated or taken into consideration by the job is very discouraging and shows that the job doesn't care about the employee's efforts."}}
{"translation": {"en1": "Does the sentence \"A star was inserted in the Christmas tree, thus messing it up.\" entail or contradict the sentence \"A star crowns the Christmas Tree.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A star crowns the Christmas Tree means that the star is the finishing touch or decoration on the tree, whereas, the contradiction suggests that the star is actually ruining the tree."}}
{"translation": {"en1": "Does the sentence \"All fire-flush 'd when forest trees were grown.\" entail or contradict the sentence \"All fire-flush 'd when forest trees smoldered.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A smolder is a slow, steady burn which is opposite of  tree growing."}}
{"translation": {"en1": "Does the sentence \"without taking anything else into consideration, she had chosen to do what she enjoyed most - working with young children.\" entail or contradict the sentence \"at the end of the day she had chosen to do what she enjoyed most - working with young children.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The idiom at the end of the day means when everything else has been taken into consideration, but this sentence describes a situation where she didn't consider anything else."}}
{"translation": {"en1": "Does the sentence \"I had to deal with a lady and her 2 daughters that had lice\" entail or contradict the sentence \"I had to endure the torture of dealing with a lady and her 2 daughters that had lice\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Having to deal with lice is often a very unpleasant experience, especially if there are multiple people involved."}}
{"translation": {"en1": "Does the sentence \"Westerns have such a dated quality.\" entail or contradict the sentence \"‘ Westerns have a gladiatorial , timeless quality .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A gladiator is a person who fought to the death in ancient Rome for entertainment, which is timeless similar to the westerns, while the contradiction is saying that Westerns are now outdated."}}
{"translation": {"en1": "Does the sentence \"Here, I told the truth but was wrongfully accused .\" entail or contradict the sentence \"And truth exalted, and righted wrong.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. And truth exalted, and righted wrong means that even though I was telling the truth, I was still accused."}}
{"translation": {"en1": "Does the sentence \"My friends ditched me during a rock concert.\" entail or contradict the sentence \"I was feeling totally accepted when my friends ditched me during the rock concert.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. When someone ditches their friends during the concert, it implies that they are not accepted by them which is not a good feeling."}}
{"translation": {"en1": "Does the sentence \"A fly landed on the empty and crawled across it.\" entail or contradict the sentence \"A fly landed on the empty , staring vizor , and crawled across it .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. This is a metaphor for something crawling across an empty space."}}
{"translation": {"en1": "Does the sentence \"After releasing his rage he was like a ferocious wolf.\" entail or contradict the sentence \"After letting off his rage he sat down like a lamb.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. After he releases his rage, he is no longer calm and docile like a lamb, but instead is fierce and aggressive like a wolf."}}
{"translation": {"en1": "Does the sentence \"We were in complete harmony and order.\" entail or contradict the sentence \"Everything at sixes and sevens.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To be at sixes and sevens means to be frazzled or disorganized, but the sentence describes being in complete harmony and order."}}
{"translation": {"en1": "Does the sentence \"There's a red fireball burning among the clouds.\" entail or contradict the sentence \"A flame ablaze that sprints amid the skies.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Ablaze means on fire, and sprints means it's moving quickly."}}
{"translation": {"en1": "Does the sentence \"The other night me and my friend played with a Ouija board... and it spoke to us.\" entail or contradict the sentence \"We were playing with a Ouija board and all of a sudden it started talking to us, which made me feel like I was having a heart attack.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Playing with a Ouija board is often associated with contacting the dead and so when it starts talking to you it can be quite a shock and very scary, causing people to feel like they are having a heart attack."}}
{"translation": {"en1": "Does the sentence \"Therefore, a guy looking for acres and isolation and not getting much value for his money would stay well away from it.\" entail or contradict the sentence \"Therefore, a guy looking for acres and isolation and maximum bang for the buck would stay well away from it.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To get bang for the buck means to get a lot of value for little cost, but in this sentence it would make sense for the guy to stay away from it if he's not looking for much value."}}
{"translation": {"en1": "Does the sentence \"I'm meeting my boyfriends parents soon and I am so scared.\" entail or contradict the sentence \"Celebrating the nerve wracking feeling of meeting my boyfriend's parents for the first time\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Meeting someone's parents for the first time can be a really daunting experience and so to celebrate it shows that the person is not looking forward to it at all and is being ironic."}}
{"translation": {"en1": "Does the sentence \"I can't believe all of the classes I wanted to take are already full!\" entail or contradict the sentence \"The fact that all of the classes I wanted to take are already full makes me feel like punching a wall\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When someone is looking forward to taking a class and they find out that it is already full it can be very frustrating because it means they have to take a different class or wait until the next semester."}}
{"translation": {"en1": "Does the sentence \"A scholarship kid feels like the whole world is hard to access and not easily achieved.\" entail or contradict the sentence \"A scholarship kid feels like the whole world is at your fingertips.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The idiom at your fingertips means that something is easily or conveniently accessed or achieved, but in this sentence the scholarship kid feels that the world is hard to access and not easily achieved."}}
{"translation": {"en1": "Does the sentence \"His voice sounded incredibly fast and energetic\" entail or contradict the sentence \"His voice sounded like a 78-rpm record turned down to 33 1/3.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. 33 1/3 is a slow speed for a record, and 78 rpm is a fast speed, so saying his voice sounded like a 78 rpm record turned down to 33 1/3 would mean it sounded slow, not fast."}}
{"translation": {"en1": "Does the sentence \"I really wish I could afford the brand new sports car my friend bought.\" entail or contradict the sentence \"I really want the new sports car my friend just bought, but sadly I cannot afford it\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. The new sports car is likely to be very expensive and so not something that someone could just afford on a whim, especially if they are envious of their friend who just bought it."}}
{"translation": {"en1": "Does the sentence \"He was even surprised to learn the men were pretty good friends when they weren't in conflict with each other over political issues.\" entail or contradict the sentence \"He was even surprised to learn the men were pretty good friends when they weren't at loggerheads over political issues.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To be at loggerheads is to be in conflict with someone, and in this sentence the men are in conflict with each other over political issues."}}
{"translation": {"en1": "Does the sentence \"My neighbors dog keeps pooping on my driveway\" entail or contradict the sentence \"My neighbors dog is a real hero for always pooping on my driveway\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would not consider their neighbor's dog to be a real hero because of the bad habit it has of pooping on other people's property."}}
{"translation": {"en1": "Does the sentence \"My car got towed when I was getting coffee for my boss\" entail or contradict the sentence \"Got my car towed when I was getting coffee for my boss and now I have to pay a fee\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Towing a car is usually quite expensive and so having to pay a fee on top of that can be quite frustrating, especially if it was for something like getting coffee for your boss."}}
{"translation": {"en1": "Does the sentence \"I was looking forward to eating cake when I got home but turns out someone ate it.\" entail or contradict the sentence \"I am so bummed that someone ate the cake that I was looking forward to eating when I got home\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When someone is looking forward to eating something and they find out that it's gone, they are often bummed out because their expectations were not met."}}
{"translation": {"en1": "Does the sentence \"My daughter always waits until I am busy to talk to me about nothing\" entail or contradict the sentence \"It really pisses me off when my daughter waits until I am busy to talk to me about nothing\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Its really annoying when somebody wait until you are busy to talk to you about something that is not important because it disrupts what you are doing and takes up your time."}}
{"translation": {"en1": "Does the sentence \"I can't believe I became one of those people who can't live without their phone.\" entail or contradict the sentence \"I feel terrible about the fact that I have become one of those people who can't live without their phone\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. \"Those people\" often refer to people who are addicted to their phones and can't go about their day without using it."}}
{"translation": {"en1": "Does the sentence \"In order to make things a lot better, the last twenty-four hours have not come up with anything conclusive.\" entail or contradict the sentence \"To add insult to injury, the last twenty four hours have not come up with anything conclusive.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To add insult to injury means to make a bad situation worse, but in this sentence the last twenty-four hours have actually improved the situation by not coming up with anything conclusive."}}
{"translation": {"en1": "Does the sentence \"A star makes the Christmas tree look terrible.\" entail or contradict the sentence \"A star christens the Christmas Tree.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A star is typically seen as something that is beautiful and shining, while something that makes the Christmas tree look terrible would be seen as ugly and dull."}}
{"translation": {"en1": "Does the sentence \"Definitely a good person, but one could tell she believes in the flower power, power of the people and a lot of other things as well from kilometers away.\" entail or contradict the sentence \"Definitely a good person, but one could tell she believes in the flower power, power of the people and all that jazz from kilometers away.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. And all that jazz means and everything else, so in this sentence it is saying that she believes in flower power and power of the people among other things."}}
{"translation": {"en1": "Does the sentence \"My brother won't stop teasing me about the pimple on my face.\" entail or contradict the sentence \"It's really sweet when my brother teases me about the pimple on my face.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Teasing someone about a flaw or insecurity usually invokes an emotional response such as feeling self-conscious or embarrassed and hence it is not sweet but rather mean."}}
{"translation": {"en1": "Does the sentence \"Allister knows nothing about wine, he is a teetotaler.\" entail or contradict the sentence \"Allister drinks Bordeaux often.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The act of drinking Bordeaux wine would require some knowledge about wine, specifically about the types of wines available, thus Allister cannot be a teetotaler and drink Bordeaux wine often."}}
{"translation": {"en1": "Does the sentence \"My wife is so cranky today\" entail or contradict the sentence \"My sweet wife has been extra crabby today and its really nice to experience this.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A wife being crabby is not a good thing and so someone feeling that its nice thing to experience is unrealistic."}}
{"translation": {"en1": "Does the sentence \"All of my friends have lost weight except for me when I used to be the skinny one.\" entail or contradict the sentence \"It's unfortunate how all my friends have lost weight except for me who used to be the skinniest one\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Losing weight is often seen as a good thing and so when all friends have lost weight and the speaker has not, it can be seen as unfortunate because the speaker is not meeting the societal standard."}}
{"translation": {"en1": "Does the sentence \"My wife is so cranky today\" entail or contradict the sentence \"My wife has been extra crabby today and it's kinda cheering me up.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A wife being crabby is not a good thing and so someone being cheered up by it is unrealistic."}}
{"translation": {"en1": "Does the sentence \"As the racehorse went slowly forward, he was on the verge of falling from it.\" entail or contradict the sentence \"As he dangled there, fighting for a toehold, his horse went like a punting boat in the wake of a royal barge.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A royal barge is a large, threatening vessel, whereas a punting boat is a small vessel that will go astern to avoid confrontation with the barge, not forward."}}
{"translation": {"en1": "Does the sentence \"It was imperceptible\" entail or contradict the sentence \"It was like a putrid scent in the air\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A putrid scent is foul and offensive, so it would be noticeable, not imperceptible."}}
{"translation": {"en1": "Does the sentence \"Ever since we met, she continued, we've been unable to agree with each other on anything.\" entail or contradict the sentence \"Ever since we met,she continued, we've been at loggerheads.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To be at loggerheads with someone means to be in conflict with them, which is what the sentence describes."}}
{"translation": {"en1": "Does the sentence \"Ellen cheerfully said she was sure her daughter would do better to understand herself.\" entail or contradict the sentence \"‘ I think she 'd do better to understand herself , ’ Ellen said tartly .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To say something tartly means to say it in a way that is sharp or acidic, while to say something cheerfully means to say it in a way that is happy and positive."}}
{"translation": {"en1": "Does the sentence \"My friend would not stop whistling even though she knows I can't stand it.\" entail or contradict the sentence \"My friend is really inconsiderate to keep whistling even though she knows I despise the sound\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. If someone knows that another person does not like something and they continue to do it anyway, it is considered inconsiderate."}}
{"translation": {"en1": "Does the sentence \"I spent a few hundred dollars on a purse which is a lot for me and it started fraying in days.\" entail or contradict the sentence \"I can't believe how poorly made the purse I bought for a few hundred dollars is and that it started fraying in days\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When something is bought for a high price it is often expected to be made of better quality materials and last longer than something that was bought for a lower price so it is understandable to be surprised and upset when it does not meet those expectations."}}
{"translation": {"en1": "Does the sentence \"I was totaly destroyed when I found that my wife took all the money that was in the bank account and left me.\" entail or contradict the sentence \"The news that my wife emptied our bank account and left me is the best feeling ever\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Having no money in the bank account and being left by a wife are both very unfavorable things and so someone considering this to be the best feeling ever is sarcastic."}}
{"translation": {"en1": "Does the sentence \"I thought we were safe as we turned the corner of the bleachers, but then I saw a cylindrical orange object getting bigger and bigger out of the corner of my eye.\" entail or contradict the sentence \"I thought we were in the clear as we began to round the corner of the bleachers, but then I saw, out of the corner of my eye something like a fast-approaching sun .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. The object was getting bigger and bigger, which would be similar to the sun getting closer and closer."}}
{"translation": {"en1": "Does the sentence \"I have an incompetent co-worker who frequently asks for help.\" entail or contradict the sentence \"Pleased with how my co-worker is incompetent and constantly needing help from me\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Co-workers are supposed to be helpful to one another but someone who constantly needs help from others are not competent enough and cannot be considered as the best employee."}}
{"translation": {"en1": "Does the sentence \"I have a bunch of flies in my room and it's driving me nuts that I cannot seem to get rid of them.!\" entail or contradict the sentence \"I have a swarm of flies in my room and it's really pleasing that I can't seem to get rid of them\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would find flies to be disgusting and would want to get rid of them as soon as possible, so anyone who finds them pleasing is not possible."}}
{"translation": {"en1": "Does the sentence \"I was expecting to get a large bonus at work today but actually received next to nothing!\" entail or contradict the sentence \"I was really looking forward to getting a large bonus at work today and instead was pleasantly surprised to receive next to nothing!\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A large bonus at work is a great thing to receive, so someone being pleasantly surprised to only receive a small amount instead is not something to be happy about."}}
{"translation": {"en1": "Does the sentence \"I do not like being around bats.\" entail or contradict the sentence \"I am not scared of bats at all, so what if they are creepy and weird.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Bats are known to carry diseases and so being only a little creepy and weird cannot be reassuring at all."}}
{"translation": {"en1": "Does the sentence \"I keep getting disconnected from my internet\" entail or contradict the sentence \"I am so frustrated with the inconsistency of my internet connection\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When someone keeps getting disconnected from their internet it is often frustrating because of the inconsistency and inconvenience it causes."}}
{"translation": {"en1": "Does the sentence \"I was furious when my sister tore all my comics\" entail or contradict the sentence \"I was really cheerful when my sister ripped all my comics\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Ripping someone's comics is usually considered to be a destructive act and so receiving joy from it is highly unlikely."}}
{"translation": {"en1": "Does the sentence \"Every Thanksgiving I eat alone.\" entail or contradict the sentence \"It's always so depressing to spend Thanksgiving alone\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Thanksgiving is typically a holiday where people spend time with family and friends and so eating alone on Thanksgiving can often be a very depressing experience."}}
{"translation": {"en1": "Does the sentence \"I have an incompetent co-worker who frequently asks for help.\" entail or contradict the sentence \"I feel like my co-worker is incompetent and constantly needing help from me\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. If someone frequently asks for help from their co-worker it is likely because they feel like they are not competent enough to do the task on their own which can be frustrating."}}
{"translation": {"en1": "Does the sentence \"He was feeling weary\" entail or contradict the sentence \"He was feeling like a lone survivor returning from the battlefield.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A lone survivor returning from the battlefield would be expected to be weary, as they would have been through a lot of fighting."}}
{"translation": {"en1": "Does the sentence \"Actions are more important than words.\" entail or contradict the sentence \"Actions speak louder than words.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. This phrase is used to say that what someone does is more important than what they say."}}
{"translation": {"en1": "Does the sentence \"By then it was a case of deliberately choosing the best option and not settling for anything less.\" entail or contradict the sentence \"By then it was a case of any port in a storm.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To say it is a case of any port in a storm is to say that any solution however unappealing is acceptable in times of trouble, but in this sentence he deliberately chose the best option and did not settle for anything less."}}
{"translation": {"en1": "Does the sentence \"Actions are not louder than words.\" entail or contradict the sentence \"Actions speak louder than words.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The metaphor suggests that deeds or actions are more important than words, while the contradiction suggests that words are more important than deeds or actions."}}
{"translation": {"en1": "Does the sentence \"Definitely a good person, but one could tell she believes in the flower power, power of the people and nothing else.\" entail or contradict the sentence \"Definitely a good person, but one could tell she believes in the flower power, power of the people and all that jazz from kilometers away.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. And all that jazz means and everything else, but in this sentence it is saying that she only believes in flower power and power of the people and nothing else."}}
{"translation": {"en1": "Does the sentence \"I ran a red light yesterday and got stopped by the cops; something very traumatizing.\" entail or contradict the sentence \"Got pulled over because I ran a red light and now I feel like a total genius.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Someone who gets pulled over for running a red light is not a genius because they broke the law and will likely have to pay a fine."}}
{"translation": {"en1": "Does the sentence \"I really don't like it when people talk during a movie.\" entail or contradict the sentence \"I think it's really considerate of people to talk during a movie and ruin the experience for everyone.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. People who talk during a movie are not considerate because they are disrupting the experience for everyone else in the theater who paid money to watch the film and hence should be quiet."}}
{"translation": {"en1": "Does the sentence \"The air inside the pipe was cool and musty.\" entail or contradict the sentence \"The air within the pipe was like an old stone cellar on a humid day.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A stone cellar is a place where the temperature and humidity are both low, so the air inside the pipe is likely to be cool and musty."}}
{"translation": {"en1": "Does the sentence \"My coworker comes into work late everyday and it drives me crazy\" entail or contradict the sentence \"It's really awesome when my super punctual coworker comes in late everyday and disrupts the work schedule\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Having a coworker who is always late and screws up the work schedule is not something to be happy about, but instead, it should be annoying."}}
{"translation": {"en1": "Does the sentence \"It made me want to sink into the floor after I accidentally spilled my drink on my friend at dinner. \" entail or contradict the sentence \"The moment I spilled my drink on my friend at dinner totally made me feel like the smartest person in the world.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Spilling a drink on someone is always an accident and therefore cannot make someone feel like they are the smartest person in the world."}}
{"translation": {"en1": "Does the sentence \"‘ I think she 'd do better to understand herself , ' Ellen said in a harsh sarcastic tone.\" entail or contradict the sentence \"‘ I think she 'd do better to understand herself , ’ Ellen said tartly .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To say something tartly means to say it in a way that is critical or harsh."}}
{"translation": {"en1": "Does the sentence \"I was terrified when we had a major ice storm and the electricity was out for weeks.  \" entail or contradict the sentence \"I was freaking out when we had a major ice storm and the electricity was out for weeks\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Being without electricity during an ice storm is very dangerous and can often lead to people being injured or even killed."}}
{"translation": {"en1": "Does the sentence \"Someone stole the stereo out of my car.\" entail or contradict the sentence \"Some bastard decided to steal my car stereo and make me suffer\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When someone's belongings are stolen it is often an upsetting experience because it feels like a personal violation and the sense that someone has deliberately decided to make them suffer."}}
{"translation": {"en1": "Does the sentence \"I was getting so fed up at the movies last week becasue children would not stop talking.\" entail or contradict the sentence \"I was about to lose my mind at the movies last week because of all the screaming kids\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. It is really frustrating when people do not follow social norms and be quiet in a movie theater so when children are screaming it can often push people to their breaking point."}}
{"translation": {"en1": "Does the sentence \"I feel broken\" entail or contradict the sentence \"I feel like a train barreling of control.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A train that is out of control is heading for a disaster and broken, which is how the person feels."}}
{"translation": {"en1": "Does the sentence \"I'm jealous of anyone who doesn't have to deal with student loan debt!\" entail or contradict the sentence \"I feel sad for folks who don't have real experience dealing with the beautiful burden of student loan\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Student loans are often difficult to repay and take a lot of time and effort, so someone who doesn't have to experience that cannot be considered unfortunate."}}
{"translation": {"en1": "Does the sentence \"I was drunk out of my mind last night.\" entail or contradict the sentence \"I totally don't regret about the state of drunkenness I was in last night\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Being drunk is never a desirable state and so regretting being in that state is justified."}}
{"translation": {"en1": "Does the sentence \"I just witnessed someone steal from an old woman walking across the street. Boils my blood!\" entail or contradict the sentence \"I just saw a kind, generous thief steal from an old woman walking across the street.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A thief is not generous because they are stealing and so seeing someone steal from an old woman is not a good thing."}}
{"translation": {"en1": "Does the sentence \"Either he was right, considered sorenson, or he was wrong, which meant not having to start the planning process all over again.\" entail or contradict the sentence \"Either he was right, considered sorenson, or he was wrong, which meant going back to the drawing board.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. If he was wrong, it meant going back to the drawing board, or starting the planning process all over again, but in this sentence it would mean not having to start over."}}
{"translation": {"en1": "Does the sentence \"I get so down on humanity sometimes watching true crime shows\" entail or contradict the sentence \"I feel like humanity is really positive after watching a lot of true crime shows\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Watching true crime shows often exposes the dark and horrific aspects of humanity and so someone who believes that it is indicative of the positive direction for humanity is mistaken."}}
{"translation": {"en1": "Does the sentence \"The other night me and my friend played with a Ouija board... and it spoke to us.\" entail or contradict the sentence \"We were playing with a Ouija board and all of a sudden it started talking to us, which made me feel like I was having a great time.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A Ouija board is often considered to be a tool used to communicate with the dead and so playing with it and having it start talking to someone implies that the person is not having a great time."}}
{"translation": {"en1": "Does the sentence \"I went to a baby shower for my friend the other day only to realize I bought a present for a baby boy and not a baby girl!\" entail or contradict the sentence \"I felt like a hero when I realized that I brought a present for a baby boy to a baby shower for a baby girl\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Realizing that you have brought a present for the wrong baby gender at a baby shower is not a heroic moment, but instead an embarrassing one."}}
{"translation": {"en1": "Does the sentence \"I got crashed into this morning by another car who was texting while driving\" entail or contradict the sentence \"I got into a car accident this morning because the other driver was too busy texting to pay attention to the road\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Texting while driving is a very dangerous activity that often leads to car accidents because people are not paying attention to the road."}}
{"translation": {"en1": "Does the sentence \"She looked so vulnerable .\" entail or contradict the sentence \"She looked like a broken china doll .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A broken china doll is a delicate object that is easily broken, thus when a person looks like one, they appear to be vulnerable."}}
{"translation": {"en1": "Does the sentence \"I was hoping to get my water heater fixed today but the plumber never showed up.\" entail or contradict the sentence \"I was looking forward to getting my water heater fixed today but the plumber never arrived, which made me feel let down\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When someone is expecting something to happen and it doesn't, they often feel disappointed or let down."}}
{"translation": {"en1": "Does the sentence \"Last weekend my friends and I went away on holiday and two of them got belligerent drunk and completely ruined the night.\" entail or contradict the sentence \"Proud of two of my very civil friends who got wasted and ruined the night last weekend.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. When someone gets drunk and causes a scene, it is not something to be proud of because it reflects badly on the person and also on their friends."}}
{"translation": {"en1": "Does the sentence \"Am I supposed to believe that that story is not true?\" entail or contradict the sentence \"Am I supposed to swallow that story?\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. one sentence expresses disbelief in someone's story whereas another sentence doubts the disbelief."}}
{"translation": {"en1": "Does the sentence \"I was furious when my sister tore all my comics\" entail or contradict the sentence \"I was dancing with joy when my sister ripped all my comics.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Ripping someone's comics is usually considered to be a destructive act and so receiving joy from it is highly unlikely."}}
{"translation": {"en1": "Does the sentence \"She was so ugly.\" entail or contradict the sentence \"She was like a pure white lily .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A lily is a beautiful flower, so saying someone is like a lily would imply that they are beautiful as well."}}
{"translation": {"en1": "Does the sentence \"I forgot to bring in the slides for the presnetation so I ended up having an awkward experience tring to do it with no materials.\" entail or contradict the sentence \"I felt like a genius trying to do a presentation without any slides\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A presentation without slides is usually very difficult to do and so trying to do one shows lack of intelligence."}}
{"translation": {"en1": "Does the sentence \"Recently a person cut in front of me in line at the super market and I was very upset about it.\" entail or contradict the sentence \"I almost had a heart attack when the person cut in front of me in line and caused me to miss my turn\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When someone cuts in line it is often seen as a very rude thing to do and can cause a lot of stress and anxiety, especially if that person ends up causing the original person to miss their turn."}}
{"translation": {"en1": "Does the sentence \"I spent two hours washing my car and it stormed a day later and got dirty again\" entail or contradict the sentence \"I feel like my car-washing efforts were in vain because it stormed the very next day and it got dirty again\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Washing a car is often seen as a waste of time if it rains the very next day because the rain will just make the car dirty again."}}
{"translation": {"en1": "Does the sentence \"you're just noticeable.\" entail or contradict the sentence \"you're just like a ninja .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A ninja is a person who is skilled in stealth and able to move undetected, whereas being noticeable would imply the opposite."}}
{"translation": {"en1": "Does the sentence \"I've been grinding for two years as an aspiring actor and I have yet to land any large roles.\" entail or contradict the sentence \"I've been working my ass off for two years as an aspiring actor and I still don't have any large roles\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. It's very difficult to land any roles as an actor, let alone large roles, and so someone who has been trying for two years without any success is likely to feel like they've been working very hard with no results."}}
{"translation": {"en1": "Does the sentence \"They were crystal blue .\" entail or contradict the sentence \"They were like a perfect summer sky .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A perfect summer sky is typically crystal blue."}}
{"translation": {"en1": "Does the sentence \"He seemed unnecessarily ugly .\" entail or contradict the sentence \"He seemed like a dark and elemental spirit .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. An elemental spirit is a being that is often seen as dark and dangerous and very ugly."}}
{"translation": {"en1": "Does the sentence \"I was getting so fed up at the movies last week becasue children would not stop talking.\" entail or contradict the sentence \"I was really enjoying myself at the movies last week because of all the screaming kids.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The presence of screaming kids at the movies can often ruin the experience for other movie-goers and so no one can enjoy themself in that situation."}}
{"translation": {"en1": "Does the sentence \"Looks like he'd enjoy the back room at the place where people are tricked into buying something.\" entail or contradict the sentence \"Looks like he'd enjoy the back room at the bait and switch.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. The bait and switch is a deceptive practice in which people are tricked into buying something, so it stands to reason that he would enjoy the back room at the bait and switch."}}
{"translation": {"en1": "Does the sentence \"His eyes were blue and hot as they stared into mine.\" entail or contradict the sentence \"His eyes bore into me like a bunsen burner flame .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A bunsen burner is a very hot flame, so his eyes staring into mine would be blue and hot, indicating that he was staring intensely."}}
{"translation": {"en1": "Does the sentence \"My boyfriend talks to his female friend more than me\" entail or contradict the sentence \"I feel very treasured and valued when my boyfriend talks more to his female friends than me.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A boyfriend talking more to his female friends than his girlfriend implies that the girlfriend is not as important as those other female friends, which devalues her and makes her feel unvalued."}}
{"translation": {"en1": "Does the sentence \"I hate driving in heavy traffic.\" entail or contradict the sentence \"Driving in heavy traffic is the worst because it makes me feel so stressed out\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Being stuck in traffic often leads to people feeling stressed out because they are wasting time and not moving closer to their destination."}}
{"translation": {"en1": "Does the sentence \"A neat step-over made by Rocastle landed Thomas right in front of the goal and therefore Rhodes moved out of his position to get out of the way.\" entail or contradict the sentence \"A neat step-over by Rocastle sent Thomas hurtling in on goal but Rhodes moved sharply off his line to smother the shot .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. In one sentence Rhodes tries to get in the way of the shot to block it whereas in the second he get off the way."}}
{"translation": {"en1": "Does the sentence \"All the meadows are frozen and chilly.\" entail or contradict the sentence \"All the meadows  wave  with blossoms ,\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Blossoms are typically associated with springtime, while frozen and chilly are typically associated with winter."}}
{"translation": {"en1": "Does the sentence \"All my friends got to go on vacation but I'm stuck here doing work because I have a tight job deadline.\" entail or contradict the sentence \"I must be so special because all my friends got to go on vacation while I'm stuck here working like a dog\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would love to go on vacation but are unable to due to work commitments and so someone who is working like a dog must not feel special at all."}}
{"translation": {"en1": "Does the sentence \"She was about my age, but her lost-child expressions gave the impression of her being nothing more than a very experienced and mature person.\" entail or contradict the sentence \"She was about my age, but her lost-child expressions gave the impression of her being nothing more than a babe in arms.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A babe in arms is a person who is gullible, naïve, or lacks experience, but in this sentence she is being described as experienced and mature."}}
{"translation": {"en1": "Does the sentence \"He was looking confident .\" entail or contradict the sentence \"He was looking like a true rajput warrior .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A true rajput warrior has to demonstrate qualities like confidence and assertiveness."}}
{"translation": {"en1": "Does the sentence \"I accidentally had expired milk today and it tasted gross\" entail or contradict the sentence \"I drank expired milk today and it made me feel like throwing up because it tasted so fine.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The milk that has gone bad and expired tastes disgusting and makes someone feel sick, so it cannot be considered fine by any means."}}
{"translation": {"en1": "Does the sentence \"I thought we were safe as we turned the corner of the bleachers, but then I saw a small, black object getting smaller and smaller out of the corner of my eye.\" entail or contradict the sentence \"I thought we were in the clear as we began to round the corner of the bleachers, but then I saw, out of the corner of my eye something like a fast-approaching sun .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A sun is a huge, bright object, whereas a small, black object would not be like a sun."}}
{"translation": {"en1": "Does the sentence \"Most of the men are cold and have hardened hearts.\" entail or contradict the sentence \"All the hearts of men were  softened.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A softened heart is one that is compassionate and caring, while a hardened heart is one that is callous and indifferent."}}
{"translation": {"en1": "Does the sentence \"I was hoping to get my water heater fixed today but the plumber never showed up.\" entail or contradict the sentence \"I was looking forward to getting my water heater fixed today but the plumber never arrived, which made me so grateful for his services.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would not be grateful to someone who never showed up to do a job they were hired for, so the plumber is not doing a good job by any means."}}
{"translation": {"en1": "Does the sentence \"She checked her reflection in the expensive and high-quality window.\" entail or contradict the sentence \"She checked her reflection in the Banana Republic window.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A Banana Republic is a small country with a corrupt government and a weak economy, but this sentence is describing an expensive and high-quality window."}}
{"translation": {"en1": "Does the sentence \"It really bugs me when telemarketers call my house.\" entail or contradict the sentence \"I can't stand it when telemarketers call my house because it's really frustrating to not be able to get a word in\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Telemarketers are often very persistent and will not take no for an answer which can be really frustrating for people who are trying to go about their day."}}
{"translation": {"en1": "Does the sentence \"Therefore, a guy looking for acres and isolation and getting the most value for his money would stay well away from it.\" entail or contradict the sentence \"Therefore, a guy looking for acres and isolation and maximum bang for the buck would stay well away from it.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To get bang for the buck means to get a lot of value for little cost, so in this sentence it would make sense for the guy to stay away from it if he's looking for maximum value."}}
{"translation": {"en1": "Does the sentence \"I really needed a 34 on the ACT to get a big scholarship and in the end I got a 33 many times.\" entail or contradict the sentence \"I was overwhelmed with happiness when I found out that I needed a 34 on the ACT to get the big scholarship, but in the end I only got a 33.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A 34 on the ACT is a minimum score and so someone getting a 33 cannot be happy because it means that they did not get the scholarship they want."}}
{"translation": {"en1": "Does the sentence \"We 've had more paperwork , not less , since the trust took over, Buzz said cheerfully .\" entail or contradict the sentence \"‘ We 've had more paperwork , not less , since the trust took over , ’ Buzz said tartly .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. one sentence says Buzz is critical about the work whereas another sentence contradicts this by saying that Buzz is cheerful, which would suggest that he does not view the paperwork as a burden."}}
{"translation": {"en1": "Does the sentence \"At work a new coworker keeps looking at me in weird way.\" entail or contradict the sentence \"At work, it's totally not weird at all when a new coworker keeps looking at me in a way that makes me feel uncomfortable\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would not enjoy feeling uncomfortable at work and so the new coworker who is doing so is not behaving in a desirable way."}}
{"translation": {"en1": "Does the sentence \"I was playing basketball and I accidentally hit my sister in the head as she was walking by.\" entail or contradict the sentence \"I felt terrible when I accidentally hit my sister in the head while playing basketball\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Its common to feel bad when you accidentally hit someone, especially a family member, because its usually not done on purpose and can often cause pain."}}
{"translation": {"en1": "Does the sentence \"Oh, you know how it is, mother, when you spend the night having sex with an absolute stranger in public, you just glow a little bit more than usual.\" entail or contradict the sentence \"Oh, you know how it is, mother, when you spend the night having sex with an old flame in public, you just glow a little bit more than usual.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. An old flame is a former lover, but spending the night with an absolute stranger would not make sense and would not cause one to glow."}}
{"translation": {"en1": "Does the sentence \"Her blue-grey eyes became gentle as she stared at the three humans.\" entail or contradict the sentence \"Her grey blue eyes gaze at the three men became like a grey ironed dagger .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A dagger is a weapon, and is often used to threaten or harm people, whereas gentle eyes are not threatening."}}
{"translation": {"en1": "Does the sentence \"I was pretty sad when a girl canceled out date last week.\" entail or contradict the sentence \"The fact that the girl canceled our date made me feel pretty down\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When someone cancels a date it often leads to the person who was looking forward to the date feeling disappointed and sad."}}
{"translation": {"en1": "Does the sentence \"It was warm and humid\" entail or contradict the sentence \"It was like a woodland deadfall in winter before the snow.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A deadfall is a mass of fallen trees and branches, so saying something is like a deadfall implies it is dry and not humid, and it is cold and not warm in winter."}}
{"translation": {"en1": "Does the sentence \"I'm always bummed when I use a clever one-liner from old pop lyrics...and nobody gets it\" entail or contradict the sentence \"I feel cool when I use a clever one-liner from old pop lyrics and it doesn't even make sense to the people around me.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Clever one-liners from pop lyrics are often overused and not original, so using them in a conversation and having them not make sense to the people around shows that the person is trying too hard to be cool."}}
{"translation": {"en1": "Does the sentence \"I don't like doing my job and the duties of other co-worker that slack.\" entail or contradict the sentence \"I like the fact that my job is already hard and then I have to do the work of a lazy co-worker too\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The workload at a job is already tough and then having to do the work of a lazy co-worker on top of that makes it even harder, which is not something anyone would like."}}
{"translation": {"en1": "Does the sentence \"His hand felt too big and brutish .\" entail or contradict the sentence \"His hand felt like a bear paw .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A bear paw is large and hairy, and is often associated with being brutish."}}
{"translation": {"en1": "Does the sentence \"My roommate had sex on my bed. What a jerk!\" entail or contradict the sentence \"My roommate is a total saint for having sex on my bed without even asking me\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Having sex on someone's bed without their consent is a violation of their privacy and is considered to be rude and unsaintly."}}
{"translation": {"en1": "Does the sentence \"I felt bad seeing my ex wife kissing her new husband \" entail or contradict the sentence \"Seeing my ex wife kissing her new husband made me feel like I was a total winner\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. No one would feel good about seeing their ex wife kissing someone else."}}
{"translation": {"en1": "Does the sentence \"I spilled my drink all over the table and myself twice at a restaurant. \" entail or contradict the sentence \"Spilling my drink all over the table and myself twice at a restaurant makes me feel so cool\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Spilling a drink is never a good thing and doing it twice at a restaurant shows lack of care and common sense."}}
{"translation": {"en1": "Does the sentence \"I was so grossed out to see someone put chocolate on their nachos.  \" entail or contradict the sentence \"It makes me sick to my stomach how someone would put chocolate on their nachos\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Chocolate and nachos are two very different food items that are not meant to be eaten together."}}
{"translation": {"en1": "Does the sentence \"I have to go to court soon for a drunk driving incident and I am so scared.\" entail or contradict the sentence \"I am petrified of going to court soon because of the drunk driving incident\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Having to go to court is often a very scary experience because it is unknown what the outcome will be and there is a potential for severe consequences."}}
{"translation": {"en1": "Does the sentence \"And in her old bounds ended her despair.\" entail or contradict the sentence \"And in her old bounds axed her despair.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. In this case, the speaker is saying that the woman's despair ended when she realized her old limitations."}}
{"translation": {"en1": "Does the sentence \"All my friends got to go on vacation but I'm stuck here doing work because I have a tight job deadline.\" entail or contradict the sentence \"I feel really lucky because all my friends got to go on vacation while I'm stuck here working like a dog\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. It is not good luck to have to work while others get to enjoy a vacation and in fact, it is the opposite because it means that someone is stuck working while everyone else gets to relax."}}
{"translation": {"en1": "Does the sentence \"Her blue-grey eyes became fierce as she stared at the three humans.\" entail or contradict the sentence \"Her grey blue eyes gaze at the three men became like a grey ironed dagger .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A grey ironed dagger is a weapon that is both hard and sharp, indicating the fierce and potentially vengeful nature person of the persons gaze."}}
{"translation": {"en1": "Does the sentence \"Or, this corrupt government-led country \" entail or contradict the sentence \"Or, this Banana Republic country\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A Banana Republic is a small country whose economy depends on a single commodity and is often corrupt, which is why it would make sense for the lbd to be led by a corrupt government."}}
{"translation": {"en1": "Does the sentence \"It was palpable\" entail or contradict the sentence \"It was like a putrid scent in the air\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A putrid scent is a very strong and offensive smell, so it would be palpable, or able to be smelled, even from a distance."}}
{"translation": {"en1": "Does the sentence \"I was furious when my sister tore all my comics\" entail or contradict the sentence \"I was really mad when my sister ripped all my comics\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. If someone tears your comics then they are damaging them and most people would be upset if their comics were damaged."}}
{"translation": {"en1": "Does the sentence \"I overslept and missed my nephews party and really feel bad about it.\" entail or contradict the sentence \"I feel like the worlds best uncle for missing my nephew's birthday party.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would consider it to be an awful feeling to miss their nephew's birthday party and so someone pretending to feel good about it is being sarcastic."}}
{"translation": {"en1": "Does the sentence \"Looks like he'd enjoy the back room at the place where people are not tricked into buying something.\" entail or contradict the sentence \"Looks like he'd enjoy the back room at the bait and switch.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The bait and switch is a deceptive practice in which people are tricked into buying something, but this sentence says he would enjoy the back room at a place where people are not tricked into buying something."}}
{"translation": {"en1": "Does the sentence \"Adrenaline recedes through him powerfully.\" entail or contradict the sentence \"Adrenaline surges through him powerfully.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To surge means to rise or increase suddenly and powerfully, while to recede means to move back or retreat."}}
{"translation": {"en1": "Does the sentence \"To make things worse, the last twenty-four hours have not come up with anything conclusive\" entail or contradict the sentence \"To add insult to injury, the last twenty four hours have not come up with anything conclusive.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To add insult to injury means to make a bad situation worse, and in this sentence the last twenty-four hours have made a bad situation even worse by not coming up with anything conclusive."}}
{"translation": {"en1": "Does the sentence \"My friends ditched me during a rock concert.\" entail or contradict the sentence \"I was feeling really alone and out of place when my friends ditched me during the rock concert\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Rock concerts are often loud and overwhelming and can be really unpleasant if someone is feeling alone and out of place."}}
{"translation": {"en1": "Does the sentence \"It made me want to sink into the floor after I accidentally spilled my drink on my friend at dinner. \" entail or contradict the sentence \"The moment I spilled my drink on my friend at dinner made me feel like the biggest winner in the world\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Spilling a drink on someone is always an accident and so someone feeling like the biggest winner in the world for doing that is really ridiculous."}}
{"translation": {"en1": "Does the sentence \"She checked her reflection in the cheap and low-quality window.\" entail or contradict the sentence \"She checked her reflection in the Banana Republic window.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A Banana Republic is a small country with a corrupt government and a weak economy, and this sentence is describing a cheap and low-quality window."}}
{"translation": {"en1": "Does the sentence \"Despite everything, I believe we represent more of the qualities they deem important.\" entail or contradict the sentence \"I believe at the end of the day, we represent more of the qualities they deem important.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. At the end of the day means when everything else has been taken into consideration, but this sentence states that despite everything, the speaker still represents more of the qualities they deem important."}}
{"translation": {"en1": "Does the sentence \"My boyfriend talks to his female friend more than me\" entail or contradict the sentence \"I feel really so important when my boyfriend talks more to his female friend than me\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. When a boyfriend talks more to his female friend than his girlfriend, it implies that the girlfriend is not important which would cause her to feel bad."}}
{"translation": {"en1": "Does the sentence \"I overslept and missed my nephews party and really feel bad about it.\" entail or contradict the sentence \"I feel terrible that I missed my nephew's birthday party and wish I could go back in time to change that\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Its natural to feel bad after missing an important event like a birthday party, especially when its for a close family member, and people often wish they could go back in time and change things."}}
{"translation": {"en1": "Does the sentence \"As the racehorse went swiftly astern, he was on the verge of falling from it\" entail or contradict the sentence \"As he dangled there, fighting for a toehold, his horse went like a punting boat in the wake of a royal barge.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A royal barge is a large, threatening vessel, whereas a punting boat is a small vessel that will go astern to avoid confrontation with the barge."}}
{"translation": {"en1": "Does the sentence \"My daughter always waits until I am busy to talk to me about nothing\" entail or contradict the sentence \"It makes me appreciative of my daughters judgement of time when she waits until I am busy to talk to me about nothing.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Daughters waiting until their parents are busy to talk to them about nothing implies that they do not care about their parents' time and only want to talk when it is convenient for them."}}
{"translation": {"en1": "Does the sentence \"I tried to make a new dish last night for dinner but when it tasted too gross I had to throw it out.\" entail or contradict the sentence \"I made an experimental dish last night that fortunately tasted so delicious that I had to throw it all out\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A dish that is made to be thrown away in the trash can cannot be delicious by any means."}}
{"translation": {"en1": "Does the sentence \"All lightweight, the small packets provided the best value in terms of what was paid.\" entail or contradict the sentence \"All lightweight, the small packets provided the best bang for the buck.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To have a lot of bang for the buck means to have a lot of value for little cost, and this sentence is an example of that."}}
{"translation": {"en1": "Does the sentence \"The whole family moved out without any of their belongings.\" entail or contradict the sentence \"The whole family moved out bag and baggage.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To move out bag and baggage means to move out with all of one's belongings, but the family moved out without any of their belongings."}}
{"translation": {"en1": "Does the sentence \"All lightweight, the small packets provided the worst value in terms of what was paid.\" entail or contradict the sentence \"All lightweight, the small packets provided the best bang for the buck.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To have a lot of bang for the buck means to have a lot of value for little cost, but this sentence describes the opposite by having little value for what was paid."}}
{"translation": {"en1": "Does the sentence \"A break up can fill you with enthusiasm and energy that can lead to a new and exciting relationship.\" entail or contradict the sentence \"A break up can leave you with a broken heart.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A break up will leave you feeling heartbroken, so it cannot fill you with enthusiasm and energy to make you feel good and happy for the future."}}
{"translation": {"en1": "Does the sentence \"Its a beautiful day outside today buts I have no one to share it with. \" entail or contradict the sentence \"It feels like my life is really worth living given I have no one to share this beautiful day with.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would say that they feel sad and down when they have no one to share their day with and hence the speaker is not really being truthful."}}
{"translation": {"en1": "Does the sentence \"All the water that looks like blood!.\" entail or contradict the sentence \"All the water  flushed  with crimson !.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Flushed with crimson means the water is red like blood."}}
{"translation": {"en1": "Does the sentence \"His voice is soft .\" entail or contradict the sentence \"His voice is like a down comforter .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A down comforter is a soft, fluffy piece of bedding, so someones voice being like a down comforter indicates that their voice is soft."}}
{"translation": {"en1": "Does the sentence \"I have to go to court soon for a drunk driving incident and I am so scared.\" entail or contradict the sentence \"I am upbeat about going to court soon because of the drunk driving incident\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Being charged with a crime like drunk driving is definitely not something to be upbeat about and so the person is sarcastically pretending to be happy about it."}}
{"translation": {"en1": "Does the sentence \"I keep getting disconnected from my internet\" entail or contradict the sentence \"I am so satisfied with the inconsistency of my internet connection.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. An inconsistent internet connection can be really frustrating because it means that the person is not able to rely on it for important tasks and hence it cannot be satisfying."}}
{"translation": {"en1": "Does the sentence \"All the men were made kinder and gentler.\" entail or contradict the sentence \"All the hearts of men were  softened.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Softer hearts means they were kinder and gentler."}}
{"translation": {"en1": "Does the sentence \"He seemed handsome.\" entail or contradict the sentence \"He seemed like a dark and elemental spirit .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. An elemental spirit is something dark and dangerous, not something that is traditionally seen as handsome."}}
{"translation": {"en1": "Does the sentence \"I applied for a loan to buy a house from the bank but didn't get it.\" entail or contradict the sentence \"I was really hopeful about getting the loan to buy my dream house, but sadly the bank rejected me\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Being rejected for a loan often leads to feelings of sadness and disappointment, especially when it is for something that was very important or desired like a dream house."}}
{"translation": {"en1": "Does the sentence \"I do not like being around bats.\" entail or contradict the sentence \"I am scared of bats because they are creepy and weird\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Bats are nocturnal animals that fly and are often associated with dark, spooky places which can make them seem creepy and weird to people who do not like them."}}
{"translation": {"en1": "Does the sentence \"After a glass of wine, he got stressed up.\" entail or contradict the sentence \"After a glass of wine, he unfurled up a bit.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To unfurl something means to open it up or to expand it, while getting stressed up suggests that it had an opposite effect."}}
{"translation": {"en1": "Does the sentence \"I was so grossed out to see someone put chocolate on their nachos.  \" entail or contradict the sentence \"It totally doesn't make me sick to my stomach how someone would put chocolate on their nachos\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Chocolate on nachos is a weird and unusual combination and so someone putting it on their nachos would make others feel sick to their stomach because of how gross it sounds."}}
{"translation": {"en1": "Does the sentence \"It's been getting to me lately that I'm constantly working and never get a break. \" entail or contradict the sentence \"It's been totally fine with me lately that I'm always working and never get a break\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Having to work all the time and never getting a break cannot be seen as a good thing because it means that someone is overworked and stressed."}}
{"translation": {"en1": "Does the sentence \"It felt like forever to come back to the cricket field, but when they arrived, the battle was still going on very slowly at the minimum possible speed.\" entail or contradict the sentence \"It seemed to take forever to return to the cricket field, but when they arrived, the battle was still going at full tilt.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. At full tilt means to go as fast as possible, but in this sentence the battle was going very slowly."}}
{"translation": {"en1": "Does the sentence \"I get so frustrated when I see people littering.\" entail or contradict the sentence \"I can't believe how inconsiderate people can be by littering when there are trash cans everywhere\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. People who litter are often seen as inconsiderate because they are choosing to not use the resources that are available to them and instead choosing to litter which can be harmful to the environment."}}
{"translation": {"en1": "Does the sentence \"The whole family moved out with all of their belongings.\" entail or contradict the sentence \"The whole family moved out bag and baggage.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To move out bag and baggage means to move out with all of one's belongings, which is what the family did."}}
{"translation": {"en1": "Does the sentence \"So all rest are never fulfilled, hope always ends in despair.\" entail or contradict the sentence \"And rest can never dwell , hope never  comes.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To hope never comes means that everytime someone hopes for something, they end up being disappointed."}}
{"translation": {"en1": "Does the sentence \"Adrenaline flows through him powerfully.\" entail or contradict the sentence \"Adrenaline surges through him powerfully.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Adrenaline is a hormone that gives people a burst of energy and strength - here surges is used to mean that Adrenaline is flowing upward."}}
{"translation": {"en1": "Does the sentence \"I saw a guy put whipped cream on his taco.\" entail or contradict the sentence \"The guy's taco looked totally normal until I saw the whipped cream and then I realized he must be some food connoisseur.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Tacos are usually made with ground beef, tomatoes, onions, and spices but when someone adds whipped cream to it, it becomes a weird and abnormal dish which does not make the guy a food connoisseur."}}
{"translation": {"en1": "Does the sentence \"Her body became limp\" entail or contradict the sentence \"Her body became like a partially full bag of grain.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A partially full bag of grain is heavy and cumbersome, so when someone's body becomes like a bag of grain, it means they are having difficulty to support themselves and are limp."}}
{"translation": {"en1": "Does the sentence \"Allister enjoys drinking Bordeaux wine on a regular basis.\" entail or contradict the sentence \"Allister drinks Bordeaux often.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Drinking often means someone drinks on a regular basis."}}
{"translation": {"en1": "Does the sentence \"A weather vane tops the building.\" entail or contradict the sentence \"A weather vane caps the building.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A weather vane is a type of decoration that is often placed on the top of a building, thus, here the word cap is used to mean the top of the building."}}
{"translation": {"en1": "Does the sentence \"Her movements were slow and deliberate .\" entail or contradict the sentence \"Her movements like a strange strip tease .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A strip tease is a slow, sensual dance where the performer gradually removes their clothing."}}
{"translation": {"en1": "Does the sentence \"I was terrified when we had a major ice storm and the electricity was out for weeks.  \" entail or contradict the sentence \"I felt like partying all night long when we had a major ice storm and the electricity was out for weeks.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would not feel like partying all night long when they are unable to use electricity which is a basic necessity in today's world."}}
{"translation": {"en1": "Does the sentence \"She had been two years ahead of me at school and not at all the most popular girl.\" entail or contradict the sentence \"She had been two years ahead of me at school and the most popular girl, bar none.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To be bar none means to be absolutely or with no exceptions, but in this sentence the girl is not at all the most popular."}}
{"translation": {"en1": "Does the sentence \"I was supposed to meet up with someone to sell a belonging but they flaked.\" entail or contradict the sentence \"They did me a favour by flaking on me so that I could put in a lot more effort to resell my belongings to someone else.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. When someone flakes on you, it becomes a lot more work to try and resell your belongings to someone else as opposed to if they had just shown up so its anything but a favor."}}
{"translation": {"en1": "Does the sentence \"The setting of western movies is appealing to us because it resembles a gladiator arena with shooting guns.\" entail or contradict the sentence \"‘ Westerns have a gladiatorial , timeless quality .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Gladiatorial means relating to or suggestive of a gladiator, who used to take part in armed comb with others in violent confrontation, much like western movies that are appealing to us because of the violence."}}
{"translation": {"en1": "Does the sentence \"My coworker comes into work late everyday and it drives me crazy\" entail or contradict the sentence \"It's really delightful when my coworker comes in late everyday and disrupts the work schedule\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Coworkers coming in late everyday can lead to a lot of disruption in the work schedule and so someone considering it to be delightful is highly unrealistic."}}
{"translation": {"en1": "Does the sentence \"Ever since I moved away from home I've had trouble meeting people and making friends\" entail or contradict the sentence \"The fact that I moved away from home and have yet to make any friends makes me feel really popular\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Moving away from home and not being able to make friends shows that the person is unpopular and not well-liked."}}
{"translation": {"en1": "Does the sentence \"His hand felt too small and delicate.\" entail or contradict the sentence \"His hand felt like a bear paw .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A bear paw is large and rough, so it would not feel small and delicate."}}
{"translation": {"en1": "Does the sentence \"My neighbors dog keeps pooping on my driveway\" entail or contradict the sentence \"My neighbors dog is a real jerk for always pooping on my driveway\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Dogs poop in their own yards, not on their neighbor's property so it's considered very rude for a dog to keep pooping on someone else's driveway."}}
{"translation": {"en1": "Does the sentence \"She had fabricated the results of its own quality-assurance testing in every single plant, absolutely and without exception.\" entail or contradict the sentence \"She had fabricated the results of its own quality-assurance testing in every single plant, bar none.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Bar none means for sure or with no exceptions, so she had fabricated the results in every single plant without exception."}}
{"translation": {"en1": "Does the sentence \"I was totaly destroyed when I found that my wife took all the money that was in the bank account and left me.\" entail or contradict the sentence \"The news that my wife emptied our bank account and left me totally made my day.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Losing all the money in the bank account and being left by a wife would be a really bad day and not something to be happy about."}}
{"translation": {"en1": "Does the sentence \"What a crazy concept to have whatever you want easily or conveniently accessed, accomplished or achieved.\" entail or contradict the sentence \"What a crazy concept to have whatever you want at your fingertips.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. The idiom at your fingertips means easily or conveniently accessed, accomplished or achieved, so the entailment is that the concept is easily or conveniently achieved."}}
{"translation": {"en1": "Does the sentence \"In order to make things a lot better, a boy was leading a handsome sheep on a string behind him.\" entail or contradict the sentence \"To add insult to injury, a boy was leading a handsome sheep on a string behind him.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To add insult to injury means to make a bad situation worse, but in this sentence the boy leading the sheep makes the situation better."}}
{"translation": {"en1": "Does the sentence \"So we're not back to the beginning.\" entail or contradict the sentence \"So were back to square one.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To be back to square one is to be back at the beginning, but this sentence suggests that they are not back at the beginning."}}
{"translation": {"en1": "Does the sentence \"A fly landed on the empty , staring vizor , and rode across it .\" entail or contradict the sentence \"A fly landed on the empty , staring vizor , and crawled across it .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To crawl across something means to move slowly or laboriously, while to ride across something means to move quickly or effortlessly."}}
{"translation": {"en1": "Does the sentence \"I spent a few hundred dollars on a purse which is a lot for me and it started fraying in days.\" entail or contradict the sentence \"I can't believe how sturdy the purse I bought for a few hundred dollars is and that it started fraying in days\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A purse that is sturdy and costs a few hundred dollars should not start fraying in a few days but owing to the fact that it frayed means it is not made of good quality material."}}
{"translation": {"en1": "Does the sentence \"After drinking a couple of martinis he gets so drunk that he becomes sick.\" entail or contradict the sentence \"After three martinis, Abhinav was feeling unwell.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. After drinking a couple of martinis, Abhinav's blood alcohol level rose to the point where he felt sick."}}
{"translation": {"en1": "Does the sentence \"His mouth tasted sweet when he kissed me.\" entail or contradict the sentence \"The taste of his mouth on my lips was like a freshly opened pack of bubble gum.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When you first open a pack of gum, the gum is usually very sweet."}}
{"translation": {"en1": "Does the sentence \"I was looking forward to eating cake when I got home but turns out someone ate it.\" entail or contradict the sentence \"I'm super stoked that someone ate the cake that I was looking forward to eating when I got home.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The cake is a dessert which is often eaten as a celebratory treat and so someone eating it before the person who was looking forward to eating it shows a lack of consideration."}}
{"translation": {"en1": "Does the sentence \"I was totaly destroyed when I found that my wife took all the money that was in the bank account and left me.\" entail or contradict the sentence \"The news that my wife emptied our bank account and left me totally crushed me\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When someone's spouse leaves them it is often a very emotionally devastating experience and finding out that they also emptied the bank account can add insult to injury."}}
{"translation": {"en1": "Does the sentence \"I was pretty sad when a girl canceled out date last week.\" entail or contradict the sentence \"The fact that the girl canceled our date did wonders for my ego.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A date is an opportunity for two people to get to know each other and so when it is canceled, it is a setback for the ego of the person who was looking forward to it."}}
{"translation": {"en1": "Does the sentence \"So we're back to the beginning.\" entail or contradict the sentence \"So were back to square one.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To be back to square one is to be back at the beginning, or the starting point."}}
{"translation": {"en1": "Does the sentence \"She had eyes that looked bloodshot and dripped back, and her hair was dark blue, cut short, and messy.\" entail or contradict the sentence \"Her short, blue hair stuck out all over the place, her eyes were like a goth clown .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A goth clown would have dark makeup around their eyes, making them look bloodshot."}}
{"translation": {"en1": "Does the sentence \"Ever since I moved away from home I've had trouble meeting people and making friends\" entail or contradict the sentence \"The fact that I moved away from home and have yet to make any friends doesn't make me feel lonely at all.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Moving away from home is often seen as a way to make friends and so not having any friends despite relocation shows that the person is not good at making friends and hence feels lonely."}}
{"translation": {"en1": "Does the sentence \"My friends ditched me during a rock concert.\" entail or contradict the sentence \"I was feeling really lovable when my friends ditched me during the rock concert\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Ditching someone during an event, especially a rock concert, is not a nice thing to do and so the person who was ditched must have felt really bad and not precious."}}
{"translation": {"en1": "Does the sentence \"I felt bad seeing my ex wife kissing her new husband \" entail or contradict the sentence \"Seeing my ex wife kissing her new husband made me feel like very secure.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. When someone sees their ex wife kissing her new husband, it is likely to invoke feelings of jealousy and insecurity instead of making them feel secure."}}
{"translation": {"en1": "Does the sentence \"The whole process of waiting for the test results of the biopsy of a suspicious mass caused a lot of anxiety.\" entail or contradict the sentence \"Waiting for the test results of the biopsy of a suspicious mass made me feel ecstatic\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The wait for test results of a biopsy is often long and nerve-wracking and so most people cannot feels patient during that time."}}
{"translation": {"en1": "Does the sentence \"I've been grinding for two years as an aspiring actor and I have yet to land any large roles.\" entail or contradict the sentence \"Overjoyed with how I've been working my ass off for two years as an aspiring actor and I still don't have any large roles\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The goal of aspiring actors is to get large roles and so someone who has not been successful after two years is not overjoyed but rather very disappointed."}}
{"translation": {"en1": "Does the sentence \"I had to deal with a lady and her 2 daughters that had lice\" entail or contradict the sentence \"I had the honor and privilege of dealing with a lady and her two daughters who had lice\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Dealing with lice is a very unpleasant experience and most people would not consider it to be an honor or privilege."}}
{"translation": {"en1": "Does the sentence \"His eyes were cold and distant as they stared into mine.\" entail or contradict the sentence \"His eyes bore into me like a bunsen burner flame .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A bunsen burner flame is very hot, so if his eyes are like that, they would be burning into me, not be cold and distant."}}
{"translation": {"en1": "Does the sentence \"you're just stealthy .\" entail or contradict the sentence \"you're just like a ninja .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A ninja is a warrior who is known for being stealthy, so the comparison is saying that the person is just as stealthy as a ninja."}}
{"translation": {"en1": "Does the sentence \"The whole process of waiting for the test results of the biopsy of a suspicious mass caused a lot of anxiety.\" entail or contradict the sentence \"Waiting for the test results of the biopsy of a suspicious mass is something i'd always hoped for...\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Biopsy because it is a medical procedure where a small sample of tissue is taken from a suspicious mass for examination and often can lead to revelation of a disease ,so waiting for the test results would be anything but hoped for."}}
{"translation": {"en1": "Does the sentence \"I hate being around negative people and situations\" entail or contradict the sentence \"It makes me feel like dancing when I am around negative people and situations\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Negative people and situations are often draining and make someone feel unhappy, so to describe being around them as making someone feel like dancing is highly inaccurate and sarcastic."}}
{"translation": {"en1": "Does the sentence \"I felt heavy as I lost consciousness and my vision went black.\" entail or contradict the sentence \"I felt like a floating feather as my vision went black.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A feather is very light, whereas feeling heavy would be the opposite."}}
{"translation": {"en1": "Does the sentence \"I let my health insurance coverage lapse and don't have any insurance right now.\" entail or contradict the sentence \"The fact that I don't have health insurance and could get into a lot of trouble makes me really anxious\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Getting sick or injured without any health insurance coverage often leads to a lot of debt and financial trouble so it is natural to feel anxious about not having insurance."}}
{"translation": {"en1": "Does the sentence \"I ran a red light yesterday and got stopped by the cops; something very traumatizing.\" entail or contradict the sentence \"Got pulled over because I ran a red light and now I feel like an idiot\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When people break the law and get caught, they often feel stupid and ashamed because they were caught breaking the law."}}
{"translation": {"en1": "Does the sentence \"My brother won't stop teasing me about the pimple on my face.\" entail or contradict the sentence \"It's really annoying when my brother teases me about the pimple on my face\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. It's natural to find it annoying when someone points out our flaws, especially when they are things that we can't control, like a pimple."}}
{"translation": {"en1": "Does the sentence \"Faced with such an honest and forthright portrayal of her dramatic, romance-filled dreams, Alice often wondered how her mother even lasted the eleven fractured years.\" entail or contradict the sentence \"Faced with such a bait and switch of her dramatic, romance-filled dreams, Alice often wondered how her mother even lasted the eleven fractured years.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Bait and switch is a deceptive practice, but in this sentence the information being presented is honest and forthright."}}
{"translation": {"en1": "Does the sentence \"Its a beautiful day outside today buts I have no one to share it with. \" entail or contradict the sentence \"It's such a treat that I have no one to share this beautiful day with\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would say that they feel sad and down when they have no one to share their day with and hence the speaker is not really being truthful."}}
{"translation": {"en1": "Does the sentence \"Every Thanksgiving I eat alone.\" entail or contradict the sentence \"It's always so heartwarming to spend Thanksgiving alone.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts.  Thanksgiving is a time when people are usually with their families and friends and so spending it alone would not be a good thing."}}
{"translation": {"en1": "Does the sentence \"All my friends got to go on vacation but I'm stuck here doing work because I have a tight job deadline.\" entail or contradict the sentence \"I feel really left out because all my friends got to go on vacation while I'm stuck here working like a dog\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When all of your friends go on vacation while you're stuck at work it can feel very isolating and as if you're being left out on purpose."}}
{"translation": {"en1": "Does the sentence \"None of the girls at school like me.\" entail or contradict the sentence \"It's such a relief all the girls at school don't like me.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. It would be a relief if the girls at school liked the speaker, but the fact that they don't should make them feel terrible."}}
{"translation": {"en1": "Does the sentence \"To make things worse, a boy was leading a handsome sheep on a string behind him.\" entail or contradict the sentence \"To add insult to injury, a boy was leading a handsome sheep on a string behind him.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To add insult to injury means to make a bad situation worse, and in this sentence the boy leading the sheep makes the situation worse."}}
{"translation": {"en1": "Does the sentence \"Water is not working in the house and I have been sitting here all day waiting for the plumber to show up.\" entail or contradict the sentence \"I have been sitting here all day waiting for the plumber to show up and fix the water issue in the house, but nobody has arrived yet!\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. The plumber was supposed to show up and fix the water issue in the house, but has not arrived yet which is frustrating because water is a necessity."}}
{"translation": {"en1": "Does the sentence \"Not happy about the fact that my friends all met up for dinner recently and I wasn't invited.\" entail or contradict the sentence \"It's awesome that my friends all got together for dinner recently and I wasn't invited\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would want to be invited to a dinner party that their friends are having, so someone who is not happy about not being invited is indicating that they feel left out and excluded."}}
{"translation": {"en1": "Does the sentence \"My wife is so cranky today\" entail or contradict the sentence \"My wife has been extra crabby today and it's kinda getting on my nerves\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When someone is said to be 'cranky' it usually means that they are in a bad mood and are snapping at people more easily which can be irritating for those around them."}}
{"translation": {"en1": "Does the sentence \"I had to dance in front of everyone at the wedding and I can't dance well.\" entail or contradict the sentence \"Delighted with how I had to embarrassingly dance in front of everyone at the wedding and I can't dance well\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Embarrassingly dancing in front of everyone at a wedding is not a good thing and so someone being delighted by it cannot be justified."}}
{"translation": {"en1": "Does the sentence \"And he got punished by his own wishes.\" entail or contradict the sentence \"And his wishes served to  guide  him .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To serve as a guide means to lead or direct someone, while to be punished by one's own wishes would suggest that those wishes led to negative consequences."}}
{"translation": {"en1": "Does the sentence \"I went to a baby shower for my friend the other day only to realize I bought a present for a baby boy and not a baby girl!\" entail or contradict the sentence \"I felt like a genius when I realized that I brought a present for a baby boy to a baby shower for a baby girl\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Realizing that you have brought a present for the wrong baby gender at a baby shower is not a genius moment, but instead an embarrassing one."}}
{"translation": {"en1": "Does the sentence \"I just witnessed someone steal from an old woman walking across the street. Boils my blood!\" entail or contradict the sentence \"I just saw a heartless thief steal from an old woman walking across the street\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Stealing is an act of taking something without permission and often done when the person stealing is in need."}}
{"translation": {"en1": "Does the sentence \"I hate driving in heavy traffic.\" entail or contradict the sentence \"Driving in heavy traffic is the best because it makes me feel so at absolute peace.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Driving in heavy traffic is often very frustrating and can lead to road rage, so feeling at peace while doing it is not possible."}}
{"translation": {"en1": "Does the sentence \"Oh, you know how it is, mother, when you spend the night having sex with a former lover in public, you just glow a little bit more than usual.\" entail or contradict the sentence \"Oh, you know how it is, mother, when you spend the night having sex with an old flame in public, you just glow a little bit more than usual.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. An old flame is a former lover, so spending the night with a former lover would make sense and cause one to glow."}}
{"translation": {"en1": "Does the sentence \"My coworker can be really aggravating because he is constantly talking and asking me dumb questions\" entail or contradict the sentence \"My coworker can be so pleasant because he talks incessantly and asks me a lot of dumb questions.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A coworker is not pleasant when they talks incessantly and asks a lot of dumb questions because it takes up a lot of time and energy of others."}}
{"translation": {"en1": "Does the sentence \"The conversation that evening was lively and interesting.\" entail or contradict the sentence \"The conversation that evening was like a sodden landscape of melting snow.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A sodden landscape is a wet and dreary one, which would not be conducive to a lively and interesting conversation."}}
{"translation": {"en1": "Does the sentence \"I hate when people dip tobacco and then spit it everywhere.\" entail or contradict the sentence \"I find it so beautiful when people dip tobacco and spit it out all over the place\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Dipping tobacco and spitting it out is a really gross habit and so finding it beautiful is not possible."}}
{"translation": {"en1": "Does the sentence \"I can't believe I became one of those people who can't live without their phone.\" entail or contradict the sentence \"I feel incredible about the fact that I have become one of those people who can't live without their phone.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would not want to be one of those people who are so attached to their phone that they cannot live without it and hence the person speaking is not proud of this fact."}}
{"translation": {"en1": "Does the sentence \"And the song this shape reminded one of.\" entail or contradict the sentence \"And the song this shape  suggested.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. The word suggested in this case, means a reminder."}}
{"translation": {"en1": "Does the sentence \"I can't believe how much more money some people earn than me\" entail or contradict the sentence \"Ofcourse I don't feel any envy at all about how much more money some people earn than me.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would feel envy upon realizing that someone else earns more money than them, so to not feel envy at all implies that the person is in denial."}}
{"translation": {"en1": "Does the sentence \"Sir Bryan had been moping about all evening as if he was very calm and collected.\" entail or contradict the sentence \"Sir bryan had been moping about all evening as if at sixes and sevens.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To be at sixes and sevens means to be frazzled or disorganized, but the sentence describes Sir Bryan as being calm and collected."}}
{"translation": {"en1": "Does the sentence \"I worked on this project for so long but it turns out my job doesn't even want it done anymore.\" entail or contradict the sentence \"I put so much effort into this project but it looks like my job doesn't care if it gets done or not\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When someone puts a lot of time and effort into something but it turns out that it was all for nothing because their job doesn't care about it, they are likely to feel upset and frustrated."}}
{"translation": {"en1": "Does the sentence \"It smelled fresh and fragrant.\" entail or contradict the sentence \"It smelled like a moldy old basement .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A moldy basement would have a musty smell, which is not fresh and fragrant."}}
{"translation": {"en1": "Does the sentence \"I ate at a restaurant this morning and the Sriracha bottle looked like it was 1000 years old.\" entail or contradict the sentence \"The fact that the Sriracha sauce bottle at the restaurant looked like it was from the Middle Ages made me sick\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When Sriracha sauce bottles are old, the sauce inside can go bad and cause food poisoning."}}
{"translation": {"en1": "Does the sentence \"Water is not working in the house and I have been sitting here all day waiting for the plumber to show up.\" entail or contradict the sentence \"I have been sitting here all day waiting for the punctual plumber to show up and fix the water issue in the house, but nobody has arrived yet!\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. If a plumber is punctual they would arrive on time and one doesn't have to sit all day waiting for them so the speaker is being sarcastic."}}
{"translation": {"en1": "Does the sentence \"All things considered, I believe we represent more of the qualities they deem important.\" entail or contradict the sentence \"I believe at the end of the day, we represent more of the qualities they deem important.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. At the end of the day means when everything else has been taken into consideration, and in this sentence everything else has been considered and it is concluded that the speaker represents more of the qualities they deem important."}}
{"translation": {"en1": "Does the sentence \"I get so frustrated when I see people littering.\" entail or contradict the sentence \"I'm moved at how considerate people can be by littering when there are trash cans everywhere\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. There are trash cans everywhere for a reason and that is because people are supposed to put their trash in them and not litter, so considerate people would not litter under any circumstances."}}
{"translation": {"en1": "Does the sentence \"It's been getting to me lately that I'm constantly working and never get a break. \" entail or contradict the sentence \"It's been pleasing me lately that I'm always working and never getting a break\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Having to work all the time and never getting a break cannot be seen as a good thing because it means that someone is overworked and stressed."}}
{"translation": {"en1": "Does the sentence \"She was about my age, but her lost-child expressions gave the impression of her being nothing more than a inexperienced and naïve person.\" entail or contradict the sentence \"She was about my age, but her lost-child expressions gave the impression of her being nothing more than a babe in arms.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A babe in arms is a person who is gullible, naïve or lacks experience, which is how she is being described in the sentence."}}
{"translation": {"en1": "Does the sentence \"At work a new coworker keeps looking at me in weird way.\" entail or contradict the sentence \"At work, it's really fun when a new coworker keeps looking at me in a way that makes me feel uncomfortable\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. When someone looks at another person in a way that makes them feel uncomfortable, it usually invokes feelings of fear or insecurity and is not fun by any means."}}
{"translation": {"en1": "Does the sentence \"I really wouldn't worry about going to work tomorrow, he says reaching over and patting my knee, I think she may be grounded in reality.\" entail or contradict the sentence \"\"I really would'nt worry about going to work tomorrow,\" he says, reaching over and patting my knee, \"I think she may be away with the fairies.\"\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To be away with the fairies means to be out of touch with reality, but in this sentence she is instead described as being grounded in reality."}}
{"translation": {"en1": "Does the sentence \"Recently a person cut in front of me in line at the super market and I was very upset about it.\" entail or contradict the sentence \"I thanked the entire universe for introducing me to the person who cut in front of me in line and caused me to miss my turn.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The person who cut in front of someone else and caused them to miss their turn is usually considered to be very rude and selfish and so thanking the entire universe for them is not really a rational thought."}}
{"translation": {"en1": "Does the sentence \"I feel immediately superior.\" entail or contradict the sentence \"I feel like a drab buffoon.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A drab buffoon is a person who is dull and laughable, so saying that someone feels like a drab buffoon implies that they feel inferior, not superior."}}
{"translation": {"en1": "Does the sentence \"I spilled my drink all over the table and myself twice at a restaurant. \" entail or contradict the sentence \"Spilling my drink all over the table and myself twice at a restaurant makes me feel like a superhero\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Spilling a drink is always an inconvenience and not something to feel good about, so someone who feels like a superhero after doing it is being sarcastic."}}
{"translation": {"en1": "Does the sentence \"I felt bad seeing my ex wife kissing her new husband \" entail or contradict the sentence \"Seeing my ex wife kissing her new husband made me feel like I was losing everything\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Seeing an ex wife kissing her new husband can trigger feelings of jealousy and insecurity which can lead to feeling like one is losing everything."}}
{"translation": {"en1": "Does the sentence \"Sir Bryan had been moping about all evening as if he was very frazzled and disorganized.\" entail or contradict the sentence \"Sir bryan had been moping about all evening as if at sixes and sevens.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To be at sixes and sevens means to be frazzled or disorganized, which is how Sir Bryan was feeling in the evening."}}
{"translation": {"en1": "Does the sentence \"I had to deal with a lady and her 2 daughters that had lice\" entail or contradict the sentence \"I had to endure the joy of dealing with a lady and her 2 daughters that had lice\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Dealing with lice is a very unpleasant experience and most people would not consider it to be a joyful experience."}}
{"translation": {"en1": "Does the sentence \"I was playing basketball and I accidentally hit my sister in the head as she was walking by.\" entail or contradict the sentence \"I felt fantastic when I accidentally hit my sister in the head while playing basketball.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts.  Hitting someone in the head by accident is not a good thing and so feeling fantastic about it cannot be justified."}}
{"translation": {"en1": "Does the sentence \"The khan motioned widely towards alejo, displeased.\" entail or contradict the sentence \"The khan motioned widely towards alejo, like a kindergartner presenting his newest coloring page to his favorite teacher.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A kindergartner would not motion widely towards their favorite teacher if they were displeased, they would likely be very pleased with their work."}}
{"translation": {"en1": "Does the sentence \"I hate being around negative people and situations\" entail or contradict the sentence \"It gives me an immense amount of pleasure when I am around negative people and situations.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Negative people and situations are often unpleasant and draining, so being around them would not bring pleasure to anyone."}}
{"translation": {"en1": "Does the sentence \"I ran a red light yesterday and got stopped by the cops; something very traumatizing.\" entail or contradict the sentence \"Got pulled over because I ran a red light and now I feel like a genius\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Someone who gets pulled over for running a red light is not a genius because they broke the law and will likely have to pay a fine."}}
{"translation": {"en1": "Does the sentence \"I do not like being in small spaces.\" entail or contradict the sentence \"I feel free and not claustrophobic when I am in small spaces.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Being in small spaces often makes people feel uncomfortable and suffocated as if they are trapped and hence the person is not free."}}
{"translation": {"en1": "Does the sentence \"I'm meeting my boyfriends parents soon and I am so scared.\" entail or contradict the sentence \"Not an iota of nervousness over meeting my boyfriend's parents for the first time\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Meeting your boyfriends parents for the first time can be a nerve-wracking experience, so not feeling any nervousness about it would be strange."}}
{"translation": {"en1": "Does the sentence \"My brother won't stop teasing me about the pimple on my face.\" entail or contradict the sentence \"It's really fun when my brother teases me about the pimple on my face\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Teasing someone about a flaw or insecurity usually invokes an emotional response such as feeling self-conscious or embarrassed and hence it is not fun but rather mean."}}
{"translation": {"en1": "Does the sentence \"It's been getting to me lately that I'm constantly working and never get a break. \" entail or contradict the sentence \"It's been bothering me lately that I'm always working and never get a break\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. It's not healthy to work all the time without any break and it's common to feel annoyed or bothered by this situation."}}
{"translation": {"en1": "Does the sentence \"Someone stole the stereo out of my car.\" entail or contradict the sentence \"Some kind person decided to steal my car stereo which makes really thankful\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Having someone steal something from you is never a good thing and so being thankful for it is quite bizarre."}}
{"translation": {"en1": "Does the sentence \"His voice sounded incredibly slow and draggy\" entail or contradict the sentence \"His voice sounded like a 78-rpm record turned down to 33 1/3.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A 78-rpm record played at 33 1/3 would sound incredibly slow and draggy because of lower almost half speed."}}
{"translation": {"en1": "Does the sentence \"I got crashed into this morning by another car who was texting while driving\" entail or contradict the sentence \"I got into a car accident this morning because the other driver was being very responsible by paying attention to his text messages over the road.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. he other driver was not being responsible by texting while driving and hence got into a car accident."}}
{"translation": {"en1": "Does the sentence \"I was tired and strengthless when kris got back home at spot-on ten to eight.\" entail or contradict the sentence \"I was like an overworked donkey when kris got back home at spot-on ten to eight.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. An overworked donkey is one that has been worked to the point of exhaustion, and is thus tired and strengthless."}}
{"translation": {"en1": "Does the sentence \"Ever since I moved away from home I've had trouble meeting people and making friends\" entail or contradict the sentence \"The fact that I moved away from home and have yet to make any friends makes me feel really lonely\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. It's often hard to meet people and make friends when you move away from home because you don't have the same social support system that you're used to."}}
{"translation": {"en1": "Does the sentence \"When I think of my landlord I get pretty mad as they don't do half the things they promised\" entail or contradict the sentence \"I am filled with gratitude for my attentive landlord when they don't do the things they said they would\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A landlord is someone who is responsible for taking care of repairs and other duties in an apartment complex, so when they don't do what they said, it leads to dissatisfaction on the tenant's behalf."}}
{"translation": {"en1": "Does the sentence \"I accidentally had expired milk today and it tasted gross\" entail or contradict the sentence \"I drank expired milk today and it made me feel like throwing up because it tasted so gross\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Drinking milk that has expired often tastes gross and can make people feel nauseous and like they want to throw up."}}
{"translation": {"en1": "Does the sentence \"It was cold and dry\" entail or contradict the sentence \"It was like a woodland deadfall in winter before the snow.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A deadfall is a cold, dry place in the woods."}}
{"translation": {"en1": "Does the sentence \"I got crashed into this morning by another car who was texting while driving\" entail or contradict the sentence \"Pleased with how I got into a car accident this morning because the other driver was too busy texting to pay attention to the road.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Getting into a car accident is never a good thing and the other driver being busy with texting only exacerbates the situation."}}
{"translation": {"en1": "Does the sentence \"I ate at a restaurant this morning and the Sriracha bottle looked like it was 1000 years old.\" entail or contradict the sentence \"The fact that the Sriracha sauce bottle at the restaurant looked like it was from the Middle Ages made me want to give it five stars on YELP\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The sauce bottle being from the Middle Ages implies that it is old, outdated, ugly and not in good condition, so giving it five stars on YELP would be absurd."}}
{"translation": {"en1": "Does the sentence \"A neat step-over by Rocastle sent Thomas hurtling in on goal but Rhodes moved sharply off his line to get in the way of the shot .\" entail or contradict the sentence \"A neat step-over by Rocastle sent Thomas hurtling in on goal but Rhodes moved sharply off his line to smother the shot .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. smother the shot means to block the shot, here, Rhodes tried to get in the way of the shot."}}
{"translation": {"en1": "Does the sentence \"Adam closed the front door and stood there for a moment as if he could not pull himself away .\" entail or contradict the sentence \"Adam closed the front door and stood there for a moment as if he could not wrench himself away .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Wrench  means to pull or twist suddenly, so the author is saying that Adam closed the door but it was a struggle for him to do so."}}
{"translation": {"en1": "Does the sentence \"It felt very comfortable, nothing is going to happen, and everyone knows exactly what it is.\" entail or contradict the sentence \"It felt a little like a first date\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A first date is a time when people are getting to know each other and there is potential for something to happen between them, whereas if everyone knows what it is and nothing is going to happen, then it would not feel like a first date."}}
{"translation": {"en1": "Does the sentence \"I was supposed to meet up with someone to sell a belonging but they flaked.\" entail or contradict the sentence \"Delighted with how they flaked on me and now I have to resell my belonging to someone else which is going to take a lot more effort\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. When someone flakes on another person, it leaves them in a difficult situation because they have to resell their belongings to someone else and hence they cannot be delighted."}}
{"translation": {"en1": "Does the sentence \"I can't believe all of the classes I wanted to take are already full!\" entail or contradict the sentence \"The fact that all of the classes I wanted to are already full makes me feel like throwing a party.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would feel disappointed and angry if all the classes they wanted were already full, but in this person's case, they feel like throwing a party which is completely unrealistic."}}
{"translation": {"en1": "Does the sentence \"I can't believe I became one of those people who can't live without their phone.\" entail or contradict the sentence \"I feel cheerful about the fact that I have become one of those people who can't live without their phone\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would not want to be one of those people who are so attached to their phone that they cannot live without it and hence the person speaking is not proud of this fact."}}
{"translation": {"en1": "Does the sentence \"After three martinis, Abhinav was joyful.\" entail or contradict the sentence \"After three martinis, Abhinav was feeling unwell.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The martinis have made Abhinav feel unwell, so drinking cannot put him in a good mood to feel happy and relaxed."}}
{"translation": {"en1": "Does the sentence \"None of the water in the sink was red !.\" entail or contradict the sentence \"All the water  flushed  with crimson !.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. All the water being flushed with crimson would suggest that it is filled with blood, while none of the water being red would suggest that there is no blood present."}}
{"translation": {"en1": "Does the sentence \"She looked so strong.\" entail or contradict the sentence \"She looked like a broken china doll .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A china doll is made out of porcelain, which is a fragile material, hence, looking like her could not be perceived as strong."}}
{"translation": {"en1": "Does the sentence \"His voice is loud.\" entail or contradict the sentence \"His voice is like a down comforter .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A down comforter is soft and fluffy, whereas a loud voice is harsh and grating."}}
{"translation": {"en1": "Does the sentence \"I don't like doing my job and the duties of other co-worker that slack.\" entail or contradict the sentence \"I don't like the fact that my job is already hard and then I have to do the work of a lazy co-worker too\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. It's already difficult to do a job that someone doesn't like and often people have to do the work of multiple people so having to do the work of a lazy co-worker as well makes it even harder."}}
{"translation": {"en1": "Does the sentence \"The short lawyer appeared disappointed\" entail or contradict the sentence \"The short lawyer appeared like a second string basketball player who didn't get a chance to get into the game.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A second string player is someone who is not as good as the starting players and usually doesn't get to play and naturally feels disappointment for being left out."}}
{"translation": {"en1": "Does the sentence \"His heart in his chest suddenly and excitedly started pounding very rapidly,\" entail or contradict the sentence \"And his heart within him  fluttered  ,\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Fluttered  means to beat rapidly and excitedly."}}
{"translation": {"en1": "Does the sentence \"Her body became rigid.\" entail or contradict the sentence \"Her body became like a partially full bag of grain.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A partially full bag of grain would be limp and not rigid."}}
{"translation": {"en1": "Does the sentence \"An insect floated down wobbling\" entail or contradict the sentence \"An insect floated down like a damaged aircraft\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A damaged aircraft is usually not flying smoothly, and may even be wobbling, so this simile is emphasizing that the insect was not floating down smoothly."}}
{"translation": {"en1": "Does the sentence \"There was hair in my soup and the owner wouldn't take responsibility.\" entail or contradict the sentence \"The fact that I found hair in my soup and the owner refused to take responsibility made me feel so precious\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Finding hair in soup is an extremely gross experience and the owner refusing to take responsibility only makes the person feel more belittled and wronged."}}
{"translation": {"en1": "Does the sentence \"Her movements were fast and erratic\" entail or contradict the sentence \"Her movements like a strange strip tease .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A strip tease is a slow, erotic dance, so her movements being fast and erratic would not be like a strip tease."}}
{"translation": {"en1": "Does the sentence \"£45,000 was the asking price and I was not astonished that the sale eventually took place .\" entail or contradict the sentence \"£45,000 was the asking price and I was not surprised that the sale , so to speak , hung fire .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. one sentence means that due to the high price the sale was delayed whereas another sentence says that due to the low price the sale took place."}}
{"translation": {"en1": "Does the sentence \"After a glass of wine, he relaxed up a bit.\" entail or contradict the sentence \"After a glass of wine, he loosened up a bit.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Loosen up means to become less tense or nervous."}}
{"translation": {"en1": "Does the sentence \"He looked like he was already ahead.\" entail or contradict the sentence \"It looked like he was back to square one.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To be back at square one is to be back at the beginning, but this sentence suggests he's already ahead."}}
{"translation": {"en1": "Does the sentence \"When I think of my landlord I get pretty mad as they don't do half the things they promised\" entail or contradict the sentence \"I get so mad about my landlord when they don't do the things they said they would\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Landlords are often dishonest about the state of the property they are renting out and what they will do to take care of it so when they don't follow through on their promises it is natural to get mad."}}
{"translation": {"en1": "Does the sentence \"When I think of my landlord I get pretty mad as they don't do half the things they promised\" entail or contradict the sentence \"I feel so satisfied with my landlord when they don't do the things they said they would\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A landlord is someone who is responsible for taking care of repairs and other duties in an apartment complex, so when they don't do what they said, it leads to dissatisfaction on the tenant's behalf."}}
{"translation": {"en1": "Does the sentence \"He was feeling energetic.\" entail or contradict the sentence \"He was feeling like a lone survivor returning from the battlefield.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A battlefield is a site of destruction, with many people dying, so a lone survivor would likely feel traumatized, not energetic."}}
{"translation": {"en1": "Does the sentence \"Not happy about the fact that my friends all met up for dinner recently and I wasn't invited.\" entail or contradict the sentence \"It's completely fair that my friends all got together for dinner recently and I wasn't invited\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Being left out of a gathering of friends can feel really hurtful and hence it is not fair at all."}}
{"translation": {"en1": "Does the sentence \"I can't believe how much more money some people earn than me\" entail or contradict the sentence \"I don't feel envious at all regarding how much more money some people earn than me.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. People who earn more money than others often have a lot of privilege and advantages so feeling envy towards them is justified."}}
{"translation": {"en1": "Does the sentence \"The voice sounded natural and human-like on the other end of the phone line.\" entail or contradict the sentence \"The voice on the other end of the phone line sounded rather like a mechanical construct .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A mechanical construct is an artificial device, not something that would naturally sound like a human voice."}}
{"translation": {"en1": "Does the sentence \"I feel immediately inferior .\" entail or contradict the sentence \"I feel like a drab buffoon.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A buffoon is a clown or jester, someone who is meant to entertain but is not taken seriously and hence feels inferior."}}
{"translation": {"en1": "Does the sentence \"I really wish I could afford the brand new sports car my friend bought.\" entail or contradict the sentence \"I really want the new sports car my friend just bought, but thanks to god I can only buy it in my dreams.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A new sports car is a luxury item that many people want but only few can afford and so thanking god for not being able to afford it does not make any sense."}}
{"translation": {"en1": "Does the sentence \"What a crazy concept to have whatever you want inaccessible, unaccomplished and unachieved.\" entail or contradict the sentence \"What a crazy concept to have whatever you want at your fingertips.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The idiom at your fingertips means easily or conveniently accessed, accomplished, or achieved, but the contradiction is that the concept is inaccessible, unaccomplished and unachieved."}}
{"translation": {"en1": "Does the sentence \"I wish I had my neighbors nice new car.\" entail or contradict the sentence \"I am insanely jealous of my neighbors who just got a brand new car\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Jealousy is an emotion felt when someone has something that someone else desires and wishes they had for themselves."}}
{"translation": {"en1": "Does the sentence \"I keep getting disconnected from my internet\" entail or contradict the sentence \"I am so content with the inconsistency of my internet connection\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. An inconsistent internet connection can be really frustrating because it means that the person is not able to rely on it for important tasks and hence it cannot be something causing content."}}
{"translation": {"en1": "Does the sentence \"Last weekend my friends and I went away on holiday and two of them got belligerent drunk and completely ruined the night.\" entail or contradict the sentence \"My friends and I were on a holiday last weekend where two of my friends got wasted and absolutely elevated the spirit the night\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Getting drunk and making a scene is not something that would elevate the spirit of a night but rather degrade it."}}
{"translation": {"en1": "Does the sentence \"Faced with such a deceptive and fraudulent portrayal of her dramatic, romance-filled dreams, Alice often wondered how her mother even lasted the eleven fractured years.\" entail or contradict the sentence \"Faced with such a bait and switch of her dramatic, romance-filled dreams, Alice often wondered how her mother even lasted the eleven fractured years.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Bait and switch is a deceptive practice, so the information being presented is not true and is instead fraudulent."}}
{"translation": {"en1": "Does the sentence \"I feel intact and undamaged\" entail or contradict the sentence \"I feel like a train barreling of control.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A train that is out of control is heading for a crash, and so would not be intact and undamaged."}}
{"translation": {"en1": "Does the sentence \"The sale of the house was delayed, which was not unexpected at all.\" entail or contradict the sentence \"£45,000 was the asking price and I was not surprised that the sale , so to speak , hung fire .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To hang fire  means  to be delayed or postponed ."}}
{"translation": {"en1": "Does the sentence \"I hate being around negative people and situations\" entail or contradict the sentence \"It makes me feel like I am going to vomit when I am around negative people and situations\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Being around negative people and situations can be very draining and often makes people feel nauseous."}}
{"translation": {"en1": "Does the sentence \"And in her old bounds found her despair.\" entail or contradict the sentence \"And in her old bounds axed her despair.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To be axed means to be removed or terminated, while to be found means to be discovered or uncovered."}}
{"translation": {"en1": "Does the sentence \"I wish I had my neighbors nice new car.\" entail or contradict the sentence \"I am not at all jealous of my neighbors who just got an beautiful brand new car.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would be jealous of their neighbors if they got a new car because it is a sign of privilege and wealth, which the speaker clearly does not feel."}}
{"translation": {"en1": "Does the sentence \"I spilled my drink all over the table and myself twice at a restaurant. \" entail or contradict the sentence \"Spilling my drink all over the table and myself twice at a restaurant makes me feel so embarrassed\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. It is considered very rude to spill drinks at a restaurant and often reflects badly on the person who did it so its natural to feel embarrassed after spilling a drink multiple times."}}
{"translation": {"en1": "Does the sentence \"I tried to make a new dish last night for dinner but when it tasted too gross I had to throw it out.\" entail or contradict the sentence \"I made an experimental dish last night that unfortunately tasted so vile that I had to throw it all out\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Often times when people make new dishes they are taking a risk because they are not sure how it will taste."}}
{"translation": {"en1": "Does the sentence \"My boyfriend talks to his female friend more than me\" entail or contradict the sentence \"I feel really bad when my boyfriend talks more to his female friend than me\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. It's natural to feel bad when the person you are dating talks to someone of the opposite sex more than they talk to you because it feels like they are interested in that person more than you."}}
{"translation": {"en1": "Does the sentence \"I have a bunch of flies in my room and it's driving me nuts that I cannot seem to get rid of them.!\" entail or contradict the sentence \"I have a swarm of flies in my room and it's really irritating that I can't seem to get rid of them\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Flies are often seen as pests and they can be very irritating when they are in large numbers and someone is unable to get rid of them."}}
{"translation": {"en1": "Does the sentence \"I was drunk out of my mind last night.\" entail or contradict the sentence \"I ofcourse should not feel any remorse about the state of drunkenness I was in last night\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Someone who is drunk is often not in a good state and so should feel remorse for their actions while drunk, rather than feeling okay about it."}}
{"translation": {"en1": "Does the sentence \"My friend would not stop whistling even though she knows I can't stand it.\" entail or contradict the sentence \"My friend is really respectful to keep whistling even though she knows I despise the sound.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Whistling is often seen as a rude thing to do because it can be heard by a lot of people and it is intrusive, so someone who does it knowing that the other person doesn't like it is not respectful at all."}}
{"translation": {"en1": "Does the sentence \"Arjun was feeling a strong affection.\" entail or contradict the sentence \"Arjun was in love.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. In love means feeling a strong affection or liking for someone."}}
{"translation": {"en1": "Does the sentence \"I really needed a 34 on the ACT to get a big scholarship and in the end I got a 33 many times.\" entail or contradict the sentence \"I was just thanking my good fortune when I found out that I needed a 34 on the ACT to get the big scholarship, but in the end I only got a 33.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Getting a 34 on ACT would have ensured that the person gets a large scholarship, but getting a 33 means that they will not be able to get the scholarship and therefore, the person's good fortune was not really good at all."}}
{"translation": {"en1": "Does the sentence \"Every Thanksgiving I eat alone.\" entail or contradict the sentence \"It's always so refreshing to spend Thanksgiving alone\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts.  Thanksgiving is a time when people are usually with their families and friends and so spending it alone would not be a good thing."}}
{"translation": {"en1": "Does the sentence \"I have an incompetent co-worker who frequently asks for help.\" entail or contradict the sentence \"I feel like my co-worker is should be the employee of the month because he constantly needs help from me.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Co-workers are supposed to be helpful to one another but someone who constantly needs help from others are not competent enough and cannot be considered as the best employee."}}
{"translation": {"en1": "Does the sentence \"I forgot to bring in the slides for the presnetation so I ended up having an awkward experience tring to do it with no materials.\" entail or contradict the sentence \"I felt like an idiot trying to do a presentation without any slides\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Its common to use slides as a support material for presentations and so not having any slides often makes people feel unprepared and stupid."}}
{"translation": {"en1": "Does the sentence \"I forgot to bring in the slides for the presnetation so I ended up having an awkward experience tring to do it with no materials.\" entail or contradict the sentence \"I felt like a genius trying to do a presentation without any slides\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A presentation without slides is usually very difficult to do and so trying to do one shows lack of intelligence."}}
{"translation": {"en1": "Does the sentence \"The air inside the pipe was hot and fresh.\" entail or contradict the sentence \"The air within the pipe was like an old stone cellar on a humid day.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Cellars are typically humid and cool, so the air inside the pipe being like an old stone cellar on a humid day would imply that it is humid and cool, not hot and fresh."}}
{"translation": {"en1": "Does the sentence \"After working two years at the company she got  exhausted, stressed, and drained.\" entail or contradict the sentence \"After working two years for the company she was burned out.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Burn out means to be exhausted from working too much."}}
{"translation": {"en1": "Does the sentence \"Alex blew the process.\" entail or contradict the sentence \"Alex leaked the process.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. It is possible that Alex leaked the process, which is opposite of blewing the process."}}
{"translation": {"en1": "Does the sentence \"My car got towed when I was getting coffee for my boss\" entail or contradict the sentence \"Got my car towed when I was getting coffee for my boss but it's no big deal, I only have to pay a hefty fee.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. When someone gets their car towed, it is often a big deal because it is an inconvenience and costs money to get it back."}}
{"translation": {"en1": "Does the sentence \"Its a beautiful day outside today buts I have no one to share it with. \" entail or contradict the sentence \"It's such a shame that I have no one to share this beautiful day with\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Experiencing beautiful things is often more enjoyable when shared with someone and so not having anyone to share it with can be seen as a shame."}}
{"translation": {"en1": "Does the sentence \"There is a fly in my room and it is annoying the heck out of me!\" entail or contradict the sentence \"There is a fly in my room and it is really pissing me off!\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Having a fly in your room is really annoying and can often be quite irritating so it's not surprising that someone would be pissed off about it."}}
{"translation": {"en1": "Does the sentence \"Recently a person cut in front of me in line at the super market and I was very upset about it.\" entail or contradict the sentence \"I almost had an overjoyous reaction when the person cut in front of me in line and caused me to miss my turn\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The person cutting in front of someone else in line is often considered to be rude and so someone having an overjoyed reaction to that is quite contradictory."}}
{"translation": {"en1": "Does the sentence \"She had been two years ahead of me at school and absolutely the most popular girl.\" entail or contradict the sentence \"She had been two years ahead of me at school and the most popular girl, bar none.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To be bar none means to be absolutely or with no exceptions, and in this sentence the girl is absolutely the most popular."}}
{"translation": {"en1": "Does the sentence \"I do not like being around bats.\" entail or contradict the sentence \"I am so attracted to bats because they are creepy and weird\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Bats are not generally considered to be attractive animals and hence someone being attracted to them is strange."}}
{"translation": {"en1": "Does the sentence \"I overslept and missed my nephews party and really feel bad about it.\" entail or contradict the sentence \"I'm a real loyal relative for missing my nephew's birthday party.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. It is customary to attend one's nephew or niece's birthday party and so someone who does not go is not being a loyal relative."}}
{"translation": {"en1": "Does the sentence \"I tried to make a new dish last night for dinner but when it tasted too gross I had to throw it out.\" entail or contradict the sentence \"The dish I made was so delicious the trash can couldn't get enough of it.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A dish that is made to be thrown away in the trash can cannot be delicious by any means."}}
{"translation": {"en1": "Does the sentence \"The whole process of waiting for the test results of the biopsy of a suspicious mass caused a lot of anxiety.\" entail or contradict the sentence \"Waiting for the test results of the biopsy of a suspicious mass made me feel like I was going crazy\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. The wait for test results can often be very anxious and worrying, especially if the results will determine whether or not someone has a serious illness."}}
{"translation": {"en1": "Does the sentence \"His offer was so alluring\" entail or contradict the sentence \"His offer was like a faint scent of something delicious trailing through the air.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A faint scent is something that is not overpowering, but is still noticeable and enticing."}}
{"translation": {"en1": "Does the sentence \"The khan motioned widely towards alejo, pleased\" entail or contradict the sentence \"The khan motioned widely towards alejo, like a kindergartner presenting his newest coloring page to his favorite teacher.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A kindergartner presenting his coloring page is proud and pleased of his work and is hoping to receive approval from the teacher."}}
{"translation": {"en1": "Does the sentence \"And gave an answer very gravely.\" entail or contradict the sentence \"And  made  answer very gravely.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Made  answer  means  gave  an answer."}}
{"translation": {"en1": "Does the sentence \"I was so grossed out to see someone put chocolate on their nachos.  \" entail or contradict the sentence \"It makes me cheerful how someone would put chocolate on their nachos\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Chocolate is not a common topping for nachos and so someone who does that must be strange and not cheerful."}}
{"translation": {"en1": "Does the sentence \"And the Spirit , rising  skyward ,\" entail or contradict the sentence \"And the Spirit ,  stooping  earthward ,\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To stoop means to bend down or lower oneself, while to rise means to lift up or elevate oneself."}}
{"translation": {"en1": "Does the sentence \"My neighbors dog keeps pooping on my driveway\" entail or contradict the sentence \"My neighbors dog is a real sweetheart for always pooping on my driveway.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would not consider their neighbor's dog to be a sweetheart because of the bad habit it has of pooping on other people's property."}}
{"translation": {"en1": "Does the sentence \"I get so down on humaity sometimes watching true crime shows\" entail or contradict the sentence \"I feel like humanity is really going downhill after watching a lot of true crime shows\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Oftentimes, after watching a lot of true crime shows, people start to feel really negative about humanity in general because it seems like there is so much crime and violence in the world."}}
{"translation": {"en1": "Does the sentence \"He was cruising down main street, which was almost entirely empty.\" entail or contradict the sentence \"He cruised slowly down main street, which was like a ghost-town street .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A ghost town is a town with very few inhabitants, so it makes sense that a ghost-town street would be almost entirely empty."}}
{"translation": {"en1": "Does the sentence \"A star tops the Christmas tree which stands for the star of Bethlehem.\" entail or contradict the sentence \"A star christens the Christmas Tree.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A star christens the Christmas Tree, which is a symbol for the star of Bethlehem."}}
{"translation": {"en1": "Does the sentence \"The situation is not so dire that any solution no matter how unpleasant is acceptable.\" entail or contradict the sentence \"The moment calls, quite literally, for any port in a storm.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Any port in a storm means that any solution is acceptable in times of trouble, but the situation is not so dire that any solution is better than none."}}
{"translation": {"en1": "Does the sentence \"Alexander was super excited and his mood improved.\" entail or contradict the sentence \"Alexander's spirits rose.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Spirits in this context means mood or emotions, so when Alexander's mood improved, his spirits rose."}}
{"translation": {"en1": "Does the sentence \"And rest can come and settle, hope comes to fruition.\" entail or contradict the sentence \"And rest can never dwell , hope never  comes.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To rest can never dwell means that there is no respite or relief, while to have rest come to setting means that it has some relief."}}
{"translation": {"en1": "Does the sentence \"She had fabricated the results of its own quality-assurance testing in every single plant, but there was one exception.\" entail or contradict the sentence \"She had fabricated the results of its own quality-assurance testing in every single plant, bar none.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Bar none means for sure or with no exceptions, but in this sentence there is one exception."}}
{"translation": {"en1": "Does the sentence \"My boyfriend is drinking beer and he so dumb when he drinks.\" entail or contradict the sentence \"I think it's adorable when my boyfriend gets drunk and starts acting like an idiot.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Someone getting drunk and acting like an idiot is not a cute or admirable thing to do and is actually quite embarrassing."}}
{"translation": {"en1": "Does the sentence \"My brother ordered a pizza with ham and pineapple on it and it was so gross.\" entail or contradict the sentence \"My brother's decision to order a pizza with ham and pineapple on it was pretty disgusting\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Ham and pineapple is a pretty controversial pizza topping combination because many people believe that the two flavors do not go well together."}}
{"translation": {"en1": "Does the sentence \"I'm jealous with people who have a washer and dryer.\" entail or contradict the sentence \"I am not at all green with envy when I see people who have a washer and dryer in their home.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Owning a washer and dryer is a privilege because not everyone can afford to have them in their home and so being envious of people who do have them is normal."}}
{"translation": {"en1": "Does the sentence \"Gwendolyn felt frumpy.\" entail or contradict the sentence \"Gwendolyn felt like an international woman of mystery who held all the answers to all the questions this loverboy could ask.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A woman of mystery is alluring and enigmatic, whereas feeling frumpy would imply the opposite."}}
{"translation": {"en1": "Does the sentence \"After venting his anger he sat down very quietly.\" entail or contradict the sentence \"After letting off his rage he sat down like a lamb.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Lambs are known for being very quiet and gentle animals, so here, once he let off the rage he was very quite."}}
{"translation": {"en1": "Does the sentence \"I applied for a loan to buy a house from the bank but didn't get it.\" entail or contradict the sentence \"I was really hopeful about getting the loan to buy my dream house, but luckily the bank rejected me\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Applying for a loan and then getting rejected is not a favorable outcome because it means that the person will not be able to buy their dream house and cannot be considered as a sign of good luck."}}
{"translation": {"en1": "Does the sentence \"A flame that barely flickered in the skies.\" entail or contradict the sentence \"A flame ablaze that sprints amid the skies.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A flame ablaze describes a fire that is burning brightly and fiercely, while a flame that barely flickered suggests a fire that is weak and about to go out."}}
{"translation": {"en1": "Does the sentence \"It made me want to sink into the floor after I accidentally spilled my drink on my friend at dinner. \" entail or contradict the sentence \"The moment I spilled my drink on my friend at dinner made me feel like the biggest idiot in the world\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Spilling a drink on someone by accident is often seen as embarrassing and rude so it's natural to feel like the biggest idiot in the world in that moment."}}
{"translation": {"en1": "Does the sentence \"My friend is always at least 30 minutes late to everything.\" entail or contradict the sentence \"I'm always waiting 30 minutes for my tardy friend\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. If someone is always late then the people who are waiting for them often have to wait around for a long time and it can be frustrating."}}
{"translation": {"en1": "Does the sentence \"Or, this honest government-led country \" entail or contradict the sentence \"Or, this Banana Republic country\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A Banana Republic is a small country whose economy depends on a single commodity and is often corrupt, but this sentence describes an honest government."}}
{"translation": {"en1": "Does the sentence \"My daughter always waits until I am busy to talk to me about nothing\" entail or contradict the sentence \"It really pleases me when my daughter waits until I am busy to talk to me about nothing.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. When someone waits until the other person is busy to talk to them, it implies that they don't care about the other person and their time which is not a good thing."}}
{"translation": {"en1": "Does the sentence \"To ask what's it like to be a warden in d.c., Hunting down the bad guys and bringing them to justice as well as everything else that is related.\" entail or contradict the sentence \"To ask what's it like to be a warden in d.c., Hunting down the bad guys and bringing them to justice and all that jazz.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. And all that jazz means and everything else, so in this sentence it is referring to everything else that is related to being a warden in D.C."}}
{"translation": {"en1": "Does the sentence \"There is a fly in my room and it is annoying the heck out of me!\" entail or contradict the sentence \"There is a fly in my room and it is really delighting me!\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Flies are often seen as dirty and are unwelcome in a room, so someone who finds delight in having one is not being truthful."}}
{"translation": {"en1": "Does the sentence \"I have a bunch of flies in my room and it's driving me nuts that I cannot seem to get rid of them.!\" entail or contradict the sentence \"I have a swarm of flies in my room and it's really fun that I can't seem to get rid of them\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would find flies to be disgusting and would want to get rid of them as soon as possible, so anyone findng them fun is not possible."}}
{"translation": {"en1": "Does the sentence \"I hate when people dip tobacco and then spit it everywhere.\" entail or contradict the sentence \"I find it so appealing when people dip tobacco and spit it out all over the place\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Dipping tobacco and spitting it out is a really gross habit and so finding it appealing is not possible."}}
{"translation": {"en1": "Does the sentence \"My brother ordered a pizza with ham and pineapple on it and it was so gross.\" entail or contradict the sentence \"My brother's decision to order a pizza with ham and pineapple on it was pretty tantalizing\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Ham and pineapple are not two ingredients that go well together and so the brother's decision to order a pizza with that combination was not a wise one."}}
{"translation": {"en1": "Does the sentence \"After a glass of wine, he stressed up a bit.\" entail or contradict the sentence \"After a glass of wine, he loosened up a bit.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To loosen up means to become less tense or relaxed, while to stress up means to become more tense or anxious."}}
{"translation": {"en1": "Does the sentence \"I was hoping to get my water heater fixed today but the plumber never showed up.\" entail or contradict the sentence \"I was looking forward to getting my water heater fixed today but many thanks to the plumber for not showing up and making me suffer in cold.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A water heater breaking down is a huge inconvenience because it leaves people without hot water and so the plumber not showing up to fix it is really unhelpful."}}
{"translation": {"en1": "Does the sentence \"I was supposed to meet up with someone to sell a belonging but they flaked.\" entail or contradict the sentence \"They flaked on me and now I have to resell my belonging to someone else which is going to take a lot more effort\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. When someone flakes on a meeting it often causes inconvenience because now the person has to go through the trouble of finding someone else to sell their belonging to and it is often more difficult the second time around."}}
{"translation": {"en1": "Does the sentence \"Alexander's spirits sank.\" entail or contradict the sentence \"Alexander's spirits rose.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. If someone gets good news their spirits may rise at the good news but their spirit cannot sink at the same time."}}
{"translation": {"en1": "Does the sentence \"It's hurtful when a breakup makes you feel lonely and sad.\" entail or contradict the sentence \"A break up can leave you with a broken heart.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A broken heart is a metaphor for feeling sad and lonely after a breakup."}}
{"translation": {"en1": "Does the sentence \"Ever since we met, she continued, we've been in complete agreement with each other on everything.\" entail or contradict the sentence \"Ever since we met,she continued, we've been at loggerheads.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To be at loggerheads with someone means to be in conflict with them, but the sentence describes being in complete agreement."}}
{"translation": {"en1": "Does the sentence \"The voice sounded strange and robotic on the other end of the phone line.\" entail or contradict the sentence \"The voice on the other end of the phone line sounded rather like a mechanical construct .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A mechanical construct is an artificial object, so it would make sense that the voice sounded strange and robotic."}}
{"translation": {"en1": "Does the sentence \"The baby eater of Bromsgrove had recently been sent down for life, caught unaware and without any evidence or wrongdoing.\" entail or contradict the sentence \"The baby eater of Bromsgrove had recently been sent down for life, caught bang to rights.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To be caught bang to rights means to be caught with irrefutable proof of wrongdoing, but the baby eater was caught unaware and without any evidence."}}
{"translation": {"en1": "Does the sentence \"I'm jealous of anyone who doesn't have to deal with student loan debt!\" entail or contradict the sentence \"I am not at all envious of people who are debt free and don't have to deal with the burden of student loan\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Student loans are a common thing nowadays and so not having to deal with them implies privilege which should invoke envy instead of indifference."}}
{"translation": {"en1": "Does the sentence \"Alex broke the process and disclosed it.\" entail or contradict the sentence \"Alex leaked the process.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Leaking the process means that Alex revealed the process to others."}}
{"translation": {"en1": "Does the sentence \"I'm jealous of people who live in a warm climate all year long. Must be nice.\" entail or contradict the sentence \"Not at all envious of people who enjoy perfect warm climate where they don't have to go through the pain of bundling up in the winter\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts.  People who live in warm climates where they don't have to bundle up in the winter are lucky because the experience of bundling up is often very unpleasant."}}
{"translation": {"en1": "Does the sentence \"The other night me and my friend played with a Ouija board... and it spoke to us.\" entail or contradict the sentence \"We were playing with a ouija board when all of a sudden it started talking to us and trust me it wasn't scary at all.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The Ouija board is known to be a way of communicating with the dead and so playing with it and having it start talking to someone is not only scary but also quite dangerous."}}
{"translation": {"en1": "Does the sentence \"New documents getting disclosed with such irresponsibility.\" entail or contradict the sentence \"And now they were leaking all kinds of documents.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Leaking documents means that they are being released without proper care or consideration."}}
{"translation": {"en1": "Does the sentence \"He was also pathologically social\" entail or contradict the sentence \"He was also like a con man on the lookout for his next mark.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A con man is someone who is very good at manipulating people, which requires being social."}}
{"translation": {"en1": "Does the sentence \"Mildly, it began to draw him in\" entail or contradict the sentence \"like a psychic whirlpool , it began to draw him in.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A whirlpool is a strong current, so a psychic whirlpool drawing in indicates that it was drawing him in intensely, rather than mildly."}}
{"translation": {"en1": "Does the sentence \"The short lawyer appeared elated.\" entail or contradict the sentence \"The short lawyer appeared like a second string basketball player who didn't get a chance to get into the game.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A second string player is not as good as the starting players, and so they are typically not elated, but disappointed."}}
{"translation": {"en1": "Does the sentence \"I don't know how you will manage to convince me that story because it sounds like a ludicrous tale.\" entail or contradict the sentence \"Am I supposed to gobble up that story?\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Gobble up means to eat something quickly, so, in this case, the speaker is saying that the story sounds so far-fetched that there's no way they would believe it."}}
{"translation": {"en1": "Does the sentence \"I was pretty sad when a girl canceled out date last week.\" entail or contradict the sentence \"The fact that the girl canceled our date made me feel pretty attractive\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A girl cancelling a date often implies that she is not interested in the person she is supposed to be going out with and so, the fact that the girl canceled makes the guy feel unattractive."}}
{"translation": {"en1": "Does the sentence \"At work a new coworker keeps looking at me in weird way.\" entail or contradict the sentence \"At work, it's really weird when a new coworker keeps looking at me in a way that makes me feel uncomfortable\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. It's often considered rude to stare at someone for a long period of time without saying anything and if the stare is making someone feel uncomfortable then it would be considered weird behavior from the coworker."}}
{"translation": {"en1": "Does the sentence \"Not happy about the fact that my friends all met up for dinner recently and I wasn't invited.\" entail or contradict the sentence \"It's not fair that my friends all got together for dinner recently and I wasn't invited\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. It can feel like an act of exclusion when friends get together for events and the person is not included in the invitation."}}
{"translation": {"en1": "Does the sentence \"I spent two hours washing my car and it stormed a day later and got dirty again\" entail or contradict the sentence \"Thrilled with how my car-washing efforts were in vain because it stormed the very next day and it got dirty again\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Washing a car is a task that takes effort and time and so if it rains or storms the very next day, all that washing would have been for nothing and the person would be unhappy about it."}}
{"translation": {"en1": "Does the sentence \"After working two years for the company she finally got her long-awaited promotion.\" entail or contradict the sentence \"After working two years for the company she was burned out.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. These two statements contradict each other because if the woman was burned out after working for the company for two years, she would not have gotten a promotion."}}
{"translation": {"en1": "Does the sentence \"My roommate had sex on my bed. What a jerk!\" entail or contradict the sentence \"My roommate is a total jerk for having sex on my bed without even asking me\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. It is rude and inconsiderate to have sex on someone's bed without asking them first and so doing so would make someone a jerk."}}
{"translation": {"en1": "Does the sentence \"I was expecting to get a large bonus at work today but actually received next to nothing!\" entail or contradict the sentence \"I was really looking forward to getting a large bonus at work today, and as it turns out I was rewarded with beautiful gift of nothing.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts.  A bonus at work is a good thing, but getting nothing in return for it is not and hence the gift is not beautiful at all."}}
{"translation": {"en1": "Does the sentence \"There is a fly in my room and it is annoying the heck out of me!\" entail or contradict the sentence \"There is a fly in my room and it is not pissing me off at all!\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Flies are often seen as dirty and pests, so someone not being pissed off by a fly in their room is not being truthful."}}
{"translation": {"en1": "Does the sentence \"His eyes met mine warm and brown .\" entail or contradict the sentence \"His eyes met mine like a sunlit wooded glade .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A sunlit wooded glade is a place that is brown and filled with light and warmth, so when his eyes meet the speakers eyes, it is like being enveloped in a place of comfort."}}
{"translation": {"en1": "Does the sentence \"I guess we'll have to continue with our current plan, Martha said.\" entail or contradict the sentence \"I guess we 'll have to go back to the drawing board,Martha said\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To go back to the drawing board means to start from the beginning again, but in this sentence Martha says they will continue with their current plan."}}
{"translation": {"en1": "Does the sentence \"My best friend just got a new car and here I am driving the same car for 10 years.  Ugh.\" entail or contradict the sentence \"It kills me that my best friend just got a new car and I'm still driving the same one for 10 years\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Often times people upgrade things like cars and houses and when friends have newer and better things than us it can be frustrating, especially if we've had the same thing for a long time."}}
{"translation": {"en1": "Does the sentence \"I ate at a restaurant this morning and the Sriracha bottle looked like it was 1000 years old.\" entail or contradict the sentence \"The fact that the Sriracha sauce bottle at the restaurant looked like it was from the Middle Ages made me want to hug the owner\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The Sriracha sauce bottle at the restaurant looked like it was from the Middle Ages means that it is old and most likely not clean, so someone wanting to hug the owner is not a desirable outcome."}}
{"translation": {"en1": "Does the sentence \"I ate half a sandwhich before realizing the bread was moldy.\" entail or contradict the sentence \"I felt really healthy after realizing the bread from the sandwich I ate was moldy.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Realizing that the bread from the sandwich you ate was moldy would make anyone feel sick and not healthy at all."}}
{"translation": {"en1": "Does the sentence \"He looked like he was back at the beginning.\" entail or contradict the sentence \"It looked like he was back to square one.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To be back at square one is to be back at the beginning, so it looks like he's starting over from the beginning."}}
{"translation": {"en1": "Does the sentence \"All fire-flush 'd when forest trees burned.\" entail or contradict the sentence \"All fire-flush 'd when forest trees smoldered.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. This means that when the forest trees burned, everything was red from the fire."}}
{"translation": {"en1": "Does the sentence \"I guess we'll have to start from the beginning again, Martha said.\" entail or contradict the sentence \"I guess we 'll have to go back to the drawing board,Martha said\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To go back to the drawing board means to start from the beginning again, which is what Martha is saying they have to do."}}
{"translation": {"en1": "Does the sentence \"He would smash into it as fast as he could.\" entail or contradict the sentence \"He would smash into it at full tilt.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To be at full tilt means to be going as fast as possible, so he would smash into it as fast as he could."}}
{"translation": {"en1": "Does the sentence \"They were all graduates and had never actually worked before in any capacity rather than just holding student jobs.\" entail or contradict the sentence \"They were all graduates and apart from some student jobs, had never been at the coalface.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To be at the coalface means to be engaged in work at an active level, rather than just holding student jobs which is what they had done up until this point."}}
{"translation": {"en1": "Does the sentence \"I'm always bummed when I use a clever one-liner from old pop lyrics...and nobody gets it\" entail or contradict the sentence \"I feel terrible when I use a clever one-liner from old pop lyrics and it doesn't even make sense to the people around me\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A lot of old pop lyrics are clever and often have hidden meanings that people enjoy trying to figure out."}}
{"translation": {"en1": "Does the sentence \"And truth denied , and righted wrong.\" entail or contradict the sentence \"And truth exalted, and righted wrong.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. If truth is exalted, it means it is held in high esteem or considered to be important, while if truth is denied, it means it is rejected or not believed."}}
{"translation": {"en1": "Does the sentence \"I really don't like it when people talk during a movie.\" entail or contradict the sentence \"I think it's really cool when people talk during a movie and ruin the experience for everyone\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Talking during a movie is often inconsiderate and disruptive and so someone thinking it's cool is just exaggerating how terrible it really is."}}
{"translation": {"en1": "Does the sentence \"I went to a baby shower for my friend the other day only to realize I bought a present for a baby boy and not a baby girl!\" entail or contradict the sentence \"I felt like an idiot when I realized that I brought a present for a baby boy to a baby shower for a baby girl\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. It is very common for people to buy presents for baby showers that match the gender of the baby but if someone were to buy a present for the wrong gender it would be easy to feel embarrassed and like an idiot."}}
{"translation": {"en1": "Does the sentence \"But on the subject of appearing to own a stolen horse, he still managed to come up with a compelling defense.\" entail or contradict the sentence \"But on the subject of appearing to own a stolen horse, he had rincewind bang to rights and, also, a foot on his neck.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To be bang to rights means to have irrefutable proof of wrongdoing, but in this sentence the person manages to come up with a defense."}}
{"translation": {"en1": "Does the sentence \"All of my friends have lost weight except for me when I used to be the skinny one.\" entail or contradict the sentence \"It's excellent how all my friends have lost weight except for me who used to be the skinniest one.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. People often compare themselves to others and so being the only one out of a group of friends who has not lost weight would make someone feel like they are not doing well and its not excellent."}}
{"translation": {"en1": "Does the sentence \"I hate when people dip tobacco and then spit it everywhere.\" entail or contradict the sentence \"I find it so gross when people dip tobacco and spit it out all over the place\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Dipping tobacco is a disgusting habit and when people spit out the tobacco juice it often gets on other people and their belongings which is why many people find it gross."}}
{"translation": {"en1": "Does the sentence \"My car got towed when I was getting coffee for my boss\" entail or contradict the sentence \"Overjoyed that I got my car towed when I was getting coffee for my boss and now I have to pay a hefty fee\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Getting one's car towed is a very frustrating experience and so someone being overjoyed about it does not make sense."}}
{"translation": {"en1": "Does the sentence \"My friend would not stop whistling even though she knows I can't stand it.\" entail or contradict the sentence \"My friend is really considerate to keep whistling even though she knows I despise the sound.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Whistling is a common way to communicate with someone and so if someone knows that the sound annoys someone else, then it is not considerate of them to keep doing it."}}
{"translation": {"en1": "Does the sentence \"I spent two hours washing my car and it stormed a day later and got dirty again\" entail or contradict the sentence \"I feel like my car-washing efforts were very productive because it stormed the very next day and it got dirty again\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Washing a car if it gets dirty again very quickly owing to the weather is often a futile task and so someone considering it to be productive is naive."}}
{"translation": {"en1": "Does the sentence \"My coworker comes into work late everyday and it drives me crazy\" entail or contradict the sentence \"It's really frustrating when my coworker comes in late everyday and disrupts the work schedule\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. It's common for people to come into work at the same time everyday and so when someone doesn't do that it can often disrupt the work schedule and be frustrating for other employees."}}
{"translation": {"en1": "Does the sentence \"My coworker can be really aggravating because he is constantly talking and asking me dumb questions\" entail or contradict the sentence \"My coworker can be so bothersome because he talks incessantly and asks me a lot of dumb questions\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. If someone is constantly talking it can be disruptive and bothersome, especially if the person is asking a lot of questions that are considered dumb or pointless."}}
{"translation": {"en1": "Does the sentence \"It makes me very unhappy when I let someone out in traffic and they dont acknowledge me\" entail or contradict the sentence \"It enrages me when I let someone out in traffic and they don't even bother to say thank you\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Not being acknowledged after completing a kind act often leaves people feeling unappreciated and can even make them angry."}}
{"translation": {"en1": "Does the sentence \"I'm jealous with people who have a washer and dryer.\" entail or contradict the sentence \"I absolutely feel no envy when I see people who have a washer and dryer in their home.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Having a washer and dryer in one's home is a convenience that most people would love to have, so someone who does not feel envy upon seeing it is not being honest."}}
{"translation": {"en1": "Does the sentence \"I'm jealous of people who live in a warm climate all year long. Must be nice.\" entail or contradict the sentence \"I feel sorry for all the people who experience beautiful warm climate where they don't have to bundle up in the winter.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would love to experience a warm climate where they don't have to bundle up in the winter because bundling up is often very uncomfortable and a hassle."}}
{"translation": {"en1": "Does the sentence \"And so I responded to his question jokingly.\" entail or contradict the sentence \"And  made  answer very gravely.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To respond to something gravely means to do so in a serious or solemn manner, while to respond to something jokingly means to do so in a playful or humorous way."}}
{"translation": {"en1": "Does the sentence \"It makes me very unhappy when I let someone out in traffic and they dont acknowledge me\" entail or contradict the sentence \"It motivates me to do more good when I let someone out in traffic and they don't even bother to say thank you\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A polite gesture of thanks is usually given when someone lets someone out in traffic and so not receiving that shows a lack of appreciation and hence it does not motivate the person to do more good."}}
{"translation": {"en1": "Does the sentence \"I was really wishing I was moving to New York like my friend.\" entail or contradict the sentence \"I wasn't jealous at all when my friend told me that she is moving to New York leaving me behind.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would be jealous upon hearing that their friend is moving away and leaving them behind and especially when its a city of possibilities like New York."}}
{"translation": {"en1": "Does the sentence \"I wish I had my neighbors nice new car.\" entail or contradict the sentence \"I couldn't be less jealous of my neighbors, who just got a car that I could never afford.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Cars are often considered to be a status symbol and so someone who cannot afford one would feel jealous of their neighbors who can."}}
{"translation": {"en1": "Does the sentence \"His mouth tasted sour when he kissed me.\" entail or contradict the sentence \"The taste of his mouth on my lips was like a freshly opened pack of bubble gum.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A freshly opened pack of bubble gum is typically sweet, while something that tastes sour is not."}}
{"translation": {"en1": "Does the sentence \" I was super anxious when my power went out yesterday and I had no phone service.\" entail or contradict the sentence \"I was at absolute ease when my power went out and I had no phone service to contact anyone\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Losing power and phone service can be really inconvenient and cause a lot of stress, so someone being at ease when that happens is not understandable."}}
{"translation": {"en1": "Does the sentence \"I accidentally had expired milk today and it tasted gross\" entail or contradict the sentence \"I drank expired milk today and it made me feel like throwing up because it tasted so delicious\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The milk that has gone bad and expired tastes disgusting and makes someone feel sick, so it cannot be considered delicious by any means."}}
{"translation": {"en1": "Does the sentence \"An insect floated down smoothly\" entail or contradict the sentence \"An insect floated down like a damaged aircraft\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A damaged aircraft would not be floating smoothly, it would be floating erratically."}}
{"translation": {"en1": "Does the sentence \"Am I supposed to disbelieve that story?\" entail or contradict the sentence \"Am I supposed to gobble up that story?\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. To gobble something up means to consume it eagerly or ravenously, while to disbelieve something means to regard it as untrue or false."}}
{"translation": {"en1": "Does the sentence \"I was terrified when we had a major ice storm and the electricity was out for weeks.  \" entail or contradict the sentence \"I was cheerful when we had a major ice storm and the electricity was out for weeks\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would not feel cheerful when they are unable to use electricity which is a basic necessity in today's world."}}
{"translation": {"en1": "Does the sentence \"We were in complete chaos and disorder.\" entail or contradict the sentence \"Everything at sixes and sevens.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To be at sixes and sevens means to be frazzled or disorganized, which is what the sentence describes."}}
{"translation": {"en1": "Does the sentence \"He was cruising down main street, which was almost entirely full and boisterious.\" entail or contradict the sentence \"He cruised slowly down main street, which was like a ghost-town street .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A ghost town is a town that is abandoned or nearly abandoned, so it would be a street with no people, not almost entirely full of people."}}
{"translation": {"en1": "Does the sentence \"I've been grinding for two years as an aspiring actor and I have yet to land any large roles.\" entail or contradict the sentence \"Its really commendable how I still don't have any large roles inspite of working my ass off for two years as an aspiring actor.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Being an aspiring actor and not having any large roles after working hard for a long period of time cannot be considered commendable but instead unlucky."}}
{"translation": {"en1": "Does the sentence \"The baby eater of Bromsgrove had recently been sent down for life, caught red-handed with overwhelming evidence and no possible defense.\" entail or contradict the sentence \"The baby eater of Bromsgrove had recently been sent down for life, caught bang to rights.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To be caught bang to rights means to be caught with irrefutable proof of wrongdoing, which is what happened with the baby eater."}}
{"translation": {"en1": "Does the sentence \"They were murky and dark.\" entail or contradict the sentence \"They were like a perfect summer sky .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A perfect sky is usually blue and clear, whereas a murky sky is cloudy and dark."}}
{"translation": {"en1": "Does the sentence \"I saw a guy put whipped cream on his taco.\" entail or contradict the sentence \"The guy's taco looked totally normal until I saw the whipped cream and then I really wanted to hug him for his beautiful taste.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Tacos are usually savory and not sweet, so the addition of whipped cream was a strange choice and not something that deserves appreciation."}}
{"translation": {"en1": "Does the sentence \"I can't believe how much more money some people earn than me\" entail or contradict the sentence \"I feel so envious of how much more money some people earn than me.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. It is human nature to compare oneself to others and feel envious when there is a large discrepancy in earnings."}}
{"translation": {"en1": "Does the sentence \"Water is not working in the house and I have been sitting here all day waiting for the plumber to show up.\" entail or contradict the sentence \"Glad how I have been sitting here all day waiting for the plumber to show up and fix the water issue in the house, but nobody has arrived yet!\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would not be happy sitting around all day waiting for someone who never arrives and so the speaker is sarcastically glad about how they are wasting their time."}}
{"translation": {"en1": "Does the sentence \"I'm jealous of anyone who doesn't have to deal with student loan debt!\" entail or contradict the sentence \"I am insanely envious of anyone who doesn't have to deal with student loan debt!\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Student loan debt is a huge burden for many people and so anyone who doesn't have to deal with it is likely to be the object of envy for those who do."}}
{"translation": {"en1": "Does the sentence \"Such beauty and unique wonderful effect in the meadows of blossoms .\" entail or contradict the sentence \"All the meadows  wave  with blossoms ,\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Wave with blossoms means the meadows are full of blossoms."}}
{"translation": {"en1": "Does the sentence \"His offer was so unappealing\" entail or contradict the sentence \"His offer was like a faint scent of something delicious trailing through the air.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A faint scent of something delicious would be appealing, not unappealing."}}
{"translation": {"en1": "Does the sentence \"By then it was a case of grasping at straws and taking any opportunity that came his way.\" entail or contradict the sentence \"By then it was a case of any port in a storm.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To say it is a case of any port in a storm is to say that any solution however unappealing is acceptable in times of trouble, which is what he did by grasping at straws and taking any opportunity that came his way."}}
{"translation": {"en1": "Does the sentence \"The after-effect of wine being him looking more laid back.\" entail or contradict the sentence \"After a glass of wine, he unfurled up a bit.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To unfurl means to relax, usually after being tense or wound up."}}
{"translation": {"en1": "Does the sentence \"I have to go to court soon for a drunk driving incident and I am so scared.\" entail or contradict the sentence \"I'm so looking forward to going to court soon because of the drunk driving incident.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The experience of going to court for a drunk driving incident is usually not a good one owing to the fact that it can lead to jail time or a huge fine and so someone who is looking forward to it is not being real."}}
{"translation": {"en1": "Does the sentence \"I had to dance in front of everyone at the wedding and I can't dance well.\" entail or contradict the sentence \"I had to embarrassingly dance in front of everyone at the wedding and I can't dance well\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Being asked to dance in front of a large group of people is often embarrassing, especially if the person cannot dance well."}}
{"translation": {"en1": "Does the sentence \"I just witnessed someone steal from an old woman walking across the street. Boils my blood!\" entail or contradict the sentence \"I just saw a nice thief steal from an old woman walking across the street\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A thief is not nice because they are stealing and so on top of that stealing from an old woman is never a good thing."}}
{"translation": {"en1": "Does the sentence \"He guided his life by the principles he always wished for .\" entail or contradict the sentence \"And his wishes served to  guide  him .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To guide someone  means to show them the way or help them make decisions."}}
{"translation": {"en1": "Does the sentence \"He was overwhelmingly obsessed with it.\" entail or contradict the sentence \"like a psychic whirlpool , it began to draw him in.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A whirlpool is a strong current, so a psychic whirlpool drawing in someone indicates the intensity and overwhelming nature of someones obsession."}}
{"translation": {"en1": "Does the sentence \"I felt weightless as I lost consciousness and my vision went black.\" entail or contradict the sentence \"I felt like a floating feather as my vision went black.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A feather floats because it is very light, and weightless."}}
{"translation": {"en1": "Does the sentence \"‘ We 've had more paperwork , not less , since the trust took over , ’ Buzz said harshly .\" entail or contradict the sentence \"‘ We 've had more paperwork , not less , since the trust took over , ’ Buzz said tartly .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. Tartly means with a sharp or acidic taste, thus, in this context, it means that Buzz is not happy with the amount of paperwork they have had since the trust took over."}}
{"translation": {"en1": "Does the sentence \"I can't believe all of the classes I wanted to take are already full!\" entail or contradict the sentence \"The fact that all of the classes I wanted to take are already full makes me feel like celebrating with champagne.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. The fact that all of the classes I wanted to take are already full means that I will not be able to take the classes that I want, which is definitely not something to celebrate about."}}
{"translation": {"en1": "Does the sentence \"A weather vane under the building.\" entail or contradict the sentence \"A weather vane caps the building.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A weather vane is used to sit on the top as described in one sentence whereas another sentence says it is under the building."}}
{"translation": {"en1": "Does the sentence \"My credit score has fallen by some 50 points in the last month and my debts are accumulating.\" entail or contradict the sentence \"I am not concerned at all about my plummeting credit score and the mounting debts.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Having a low credit score and mounting debts are both signs that someone is in financial trouble and so to act like one is not concerned about it is sarcastic."}}
{"translation": {"en1": "Does the sentence \"She had eyes that looked healthy and clear, and her hair was blue, cut short, and messy.\" entail or contradict the sentence \"Her short, blue hair stuck out all over the place, her eyes were like a goth clown .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Goth clowns typically have lots of make up, including using red color, that might make it look like her eyes are bloodshot, and not healthy."}}
{"translation": {"en1": "Does the sentence \"It smelled musty .\" entail or contradict the sentence \"It smelled like a moldy old basement .\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. A moldy old basement would have a musty smell."}}
{"translation": {"en1": "Does the sentence \"But on the subject of appearing to own a stolen horse, he was caught red-handed and had no way to defend himself. \" entail or contradict the sentence \"But on the subject of appearing to own a stolen horse, he had rincewind bang to rights and, also, a foot on his neck.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To be bang to rights means to have irrefutable proof of wrongdoing, which in this sentence is the act of appearing to own a stolen horse."}}
{"translation": {"en1": "Does the sentence \"My coworker can be really aggravating because he is constantly talking and asking me dumb questions\" entail or contradict the sentence \"My coworker is so enjoyable when he talks incessantly and asks me a lot of dumb questions.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. A coworker who talks incessantly and asks a lot of dumb questions can be really irritating and not enjoyable at all."}}
{"translation": {"en1": "Does the sentence \"I really needed a 34 on the ACT to get a big scholarship and in the end I got a 33 many times.\" entail or contradict the sentence \"I was devastated when I found out that I needed a 34 on the ACT to get the big scholarship, but in the end I only got a 33\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. The difference between a 33 and a 34 on the ACT is often significant enough to determine whether or not someone gets a scholarship and so finding out that you didn't get the score you needed by one point is often devastating."}}
{"translation": {"en1": "Does the sentence \"When the weatherman predicts flurries, you'd better get ready for tough times, especially in December.\" entail or contradict the sentence \"When the weatherman predicta flurries, you'd better batten down the hatch, esespecially in December.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. To batten down the hatches means to prepare for difficult times, which is what the person in this sentence is doing."}}
{"translation": {"en1": "Does the sentence \"Either he was right, considered sorenson, or he was wrong, which meant starting the planning process all over again.\" entail or contradict the sentence \"Either he was right, considered sorenson, or he was wrong, which meant going back to the drawing board.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Entails. If he was wrong, it meant going back to the drawing board, or starting the planning process all over again."}}
{"translation": {"en1": "Does the sentence \"My brother ordered a pizza with ham and pineapple on it and it was so gross.\" entail or contradict the sentence \"My brother's decision to order a pizza with ham and pineapple on it was pretty appetizing.\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Ham and pineapple are not two ingredients that go well together and so the brother's decision to order a pizza with that combination was not a wise one."}}
{"translation": {"en1": "Does the sentence \"I was really wishing I was moving to New York like my friend.\" entail or contradict the sentence \"I was ecstatic when my friend told me that she is moving to New York leaving me behind\"? Please answer between \"Entails\" or \"Contradicts\" and explain your decision in a sentence.", "en2": "Contradicts. Most people would not be happy upon hearing that their friend is moving away and leaving them behind and especially when its a city of possibilities like New York."}}
